{
    "Enterprise": {
        "Initial Access": {
            "Name": "Initial Access",
            "Description": "The initial access tactic represents the vectors adversaries use to gain an initial foothold within a network.\n                ",
            "ID": "TA0001",
            "Techniques": [
                {
                    "ID": "T1189",
                    "Name": "Drive-by Compromise",
                    "Description": "A drive-by compromise is when an adversary gains access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is targeted for exploitation. This can happen in several ways, but there are a few main components: "
                },
                {
                    "ID": "T1190",
                    "Name": "Exploit Public-Facing Application",
                    "Description": "The use of software, data, or commands to take advantage of a weakness in an Internet-facing computer system or program in order to cause unintended or unanticipated behavior. The weakness in the system can be a bug, a glitch, or a design vulnerability. These applications are often websites, but can include databases (like SQL) , standard services (like SMB  or SSH), and any other applications with Internet accessible open sockets, such as web servers and related services.  Depending on the flaw being exploited this may include Exploitation for Defense Evasion."
                },
                {
                    "ID": "T1200",
                    "Name": "Hardware Additions",
                    "Description": "Computer accessories, computers, or networking hardware may be introduced into a system as a vector to gain execution. While public references of usage by APT groups are scarce, many penetration testers leverage hardware additions for initial access. Commercial and open source products are leveraged with capabilities such as passive network tapping , man-in-the middle encryption breaking , keystroke injection , kernel memory reading via DMA , adding new wireless access to an existing network , and others."
                },
                {
                    "ID": "T1091",
                    "Name": "Replication Through Removable Media",
                    "Description": "Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes. In the case of Lateral Movement, this may occur through modification of executable files stored on removable media or by copying malware and renaming it to look like a legitimate file to trick users into executing it on a separate system. In the case of Initial Access, this may occur through manual manipulation of the media, modification of systems used to initially format the media, or modification to the media's firmware itself."
                },
                {
                    "ID": "T1193",
                    "Name": "Spearphishing Attachment",
                    "Description": "Spearphishing attachment is a specific variant of spearphishing. Spearphishing attachment is different from other forms of spearphishing in that it employs the use of malware attached to an email. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon User Execution to gain execution."
                },
                {
                    "ID": "T1192",
                    "Name": "Spearphishing Link",
                    "Description": "Spearphishing with a link is a specific variant of spearphishing. It is different from other forms of spearphishing in that it employs the use of links to download malware contained in email, instead of attaching malicious files to the email itself, to avoid defenses that may inspect email attachments. "
                },
                {
                    "ID": "T1194",
                    "Name": "Spearphishing via Service",
                    "Description": "Spearphishing via service is a specific variant of spearphishing. It is different from other forms of spearphishing in that it employs the use of third party services rather than directly via enterprise email channels. "
                },
                {
                    "ID": "T1195",
                    "Name": "Supply Chain Compromise",
                    "Description": "Supply chain compromise is the manipulation of products or product delivery mechanisms prior to receipt by a final consumer for the purpose of data or system compromise. Supply chain compromise can take place at any stage of the supply chain including:"
                },
                {
                    "ID": "T1199",
                    "Name": "Trusted Relationship",
                    "Description": "Adversaries may breach or otherwise leverage organizations who have access to intended victims. Access through trusted third party relationship exploits an existing connection that may not be protected or receives less scrutiny than standard mechanisms of gaining access to a network."
                },
                {
                    "ID": "T1078",
                    "Name": "Valid Accounts",
                    "Description": "Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. "
                }
            ]
        },
        "Execution": {
            "Name": "Execution",
            "Description": "The execution tactic represents techniques that result in execution of adversary-controlled code on a local or remote system. This tactic is often used in conjunction with initial access as the means of executing code once access is obtained, and lateral movement to expand access to remote systems on a network.\n                ",
            "ID": "TA0002",
            "Techniques": [
                {
                    "ID": "T1155",
                    "Name": "AppleScript",
                    "Description": "macOS and OS X applications send AppleEvent messages to each other for interprocess communications (IPC). These messages can be easily scripted with AppleScript for local or remote IPC. Osascript executes AppleScript and any other Open Scripting Architecture (OSA) language scripts. A list of OSA languages installed on a system can be found by using the osalang program."
                },
                {
                    "ID": "T1191",
                    "Name": "CMSTP",
                    "Description": "The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a command-line program used to install Connection Manager service profiles.  CMSTP.exe accepts an installation information file (INF) as a parameter and installs a service profile leveraged for remote access connections."
                },
                {
                    "ID": "T1059",
                    "Name": "Command-Line Interface",
                    "Description": "Command-line interfaces provide a way of interacting with computer systems and is a common feature across many types of operating system platforms.  One example command-line interface on Windows systems is cmd, which can be used to perform a number of tasks including execution of other software. Command-line interfaces can be interacted with locally or remotely via a remote desktop application, reverse shell session, etc. Commands that are executed run with the current permission level of the command-line interface process unless the command includes process invocation that changes permissions context for that execution (e.g. Scheduled Task)."
                },
                {
                    "ID": "T1223",
                    "Name": "Compiled HTML File",
                    "Description": "Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system. CHM files are compressed compilations of various content such as HTML documents, images, and scripting/web related programming languages such VBA, JScript, Java, and ActiveX.  CHM content is displayed using underlying components of the Internet Explorer browser  loaded by the HTML Help executable program (hh.exe). "
                },
                {
                    "ID": "T1196",
                    "Name": "Control Panel Items",
                    "Description": "Windows Control Panel items are utilities that allow users to view and adjust computer settings. Control Panel items are registered executable (.exe) or Control Panel (.cpl) files, the latter are actually renamed dynamic-link library (.dll) files that export a CPlApplet function.   Control Panel items can be executed directly from the command line, programmatically via an application programming interface (API) call, or by simply double-clicking the file.   "
                },
                {
                    "ID": "T1173",
                    "Name": "Dynamic Data Exchange",
                    "Description": "Windows Dynamic Data Exchange (DDE) is a client-server protocol for one-time and/or continuous inter-process communication (IPC) between applications. Once a link is established, applications can autonomously exchange transactions consisting of strings, warm data links (notifications when a data item changes), hot data links (duplications of changes to a data item), and requests for command execution."
                },
                {
                    "ID": "T1106",
                    "Name": "Execution through API",
                    "Description": "Adversary tools may directly use the Windows application programming interface (API) to execute binaries. Functions such as the Windows API CreateProcess will allow programs and scripts to start other processes with proper path and argument parameters. "
                },
                {
                    "ID": "T1129",
                    "Name": "Execution through Module Load",
                    "Description": "The Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like CreateProcess(), LoadLibrary(), etc. of the Win32 API. "
                },
                {
                    "ID": "T1203",
                    "Name": "Exploitation for Client Execution",
                    "Description": "Vulnerabilities can exist in software due to unsecure coding practices that can lead to unanticipated behavior. Adversaries can take advantage of certain vulnerabilities through targeted exploitation for the purpose of arbitrary code execution. Oftentimes the most valuable exploits to an offensive toolkit are those that can be used to obtain code execution on a remote system because they can be used to gain access to that system. Users will expect to see files related to the applications they commonly used to do work, so they are a useful target for exploit research and development because of their high utility."
                },
                {
                    "ID": "T1061",
                    "Name": "Graphical User Interface",
                    "Description": "The Graphical User Interfaces (GUI) is a common way to interact with an operating system. Adversaries may use a system's GUI during an operation, commonly through a remote interactive session such as Remote Desktop Protocol, instead of through a Command-Line Interface, to search for information and execute files via mouse double-click events, the Windows Run command , or other potentially difficult to monitor interactions."
                },
                {
                    "ID": "T1118",
                    "Name": "InstallUtil",
                    "Description": "InstallUtil is a command-line utility that allows for installation and uninstallation of resources by executing specific installer components specified in .NET binaries.  InstallUtil is located in the .NET directories on a Windows system: C:\\Windows\\Microsoft.NET\\Framework\\v\\InstallUtil.exe and C:\\Windows\\Microsoft.NET\\Framework64\\v\\InstallUtil.exe. InstallUtil.exe is digitally signed by Microsoft."
                },
                {
                    "ID": "T1152",
                    "Name": "Launchctl",
                    "Description": "Launchctl controls the macOS launchd process which handles things like launch agents and launch daemons, but can execute other commands or programs itself. Launchctl supports taking subcommands on the command-line, interactively, or even redirected from standard input. By loading or reloading launch agents or launch daemons, adversaries can install persistence or execute changes they made  . Running a command from launchctl is as simple as launchctl submit -l  -- /Path/to/thing/to/execute \"arg\" \"arg\" \"arg\". Loading, unloading, or reloading launch agents or launch daemons can require elevated privileges. "
                },
                {
                    "ID": "T1168",
                    "Name": "Local Job Scheduling",
                    "Description": "On Linux and macOS systems, multiple methods are supported for creating pre-scheduled and periodic background jobs: cron,  at,  and launchd.  Unlike Scheduled Task on Windows systems, job scheduling on Linux-based systems cannot be done remotely unless used in conjunction within an established remote session, like secure shell (SSH)."
                },
                {
                    "ID": "T1177",
                    "Name": "LSASS Driver",
                    "Description": "The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain. The Local Security Authority (LSA) is the main component responsible for local security policy and user authentication. The LSA includes multiple dynamic link libraries (DLLs) associated with various other security functions, all of which run in the context of the LSA Subsystem Service (LSASS) lsass.exe process. "
                },
                {
                    "ID": "T1170",
                    "Name": "Mshta",
                    "Description": "Mshta.exe is a utility that executes Microsoft HTML Applications (HTA). HTA files have the file extension .hta.  HTAs are standalone applications that execute using the same models and technologies of Internet Explorer, but outside of the browser. "
                },
                {
                    "ID": "T1086",
                    "Name": "PowerShell",
                    "Description": "PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system.  Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the Start-Process cmdlet which can be used to run an executable and the Invoke-Command cmdlet which runs a command locally or on a remote computer. "
                },
                {
                    "ID": "T1121",
                    "Name": "Regsvcs/Regasm",
                    "Description": "Regsvcs and Regasm are Windows command-line utilities that are used to register .NET Component Object Model (COM) assemblies. Both are digitally signed by Microsoft.  "
                },
                {
                    "ID": "T1117",
                    "Name": "Regsvr32",
                    "Description": "Regsvr32.exe is a command-line program used to register and unregister object linking and embedding controls, including dynamic link libraries (DLLs), on Windows systems. Regsvr32.exe can be used to execute arbitrary binaries. "
                },
                {
                    "ID": "T1085",
                    "Name": "Rundll32",
                    "Description": "The rundll32.exe program can be called to execute an arbitrary binary. Adversaries may take advantage of this functionality to proxy execution of code to avoid triggering security tools that may not monitor execution of the rundll32.exe process because of whitelists or false positives from Windows using rundll32.exe for normal operations."
                },
                {
                    "ID": "T1053",
                    "Name": "Scheduled Task",
                    "Description": "Utilities such as at and schtasks, along with the Windows Task Scheduler, can be used to schedule programs or scripts to be executed at a date and time. A task can also be scheduled on a remote system, provided the proper authentication is met to use RPC and file and printer sharing is turned on. Scheduling a task on a remote system typically required being a member of the Administrators group on the the remote system. "
                },
                {
                    "ID": "T1064",
                    "Name": "Scripting",
                    "Description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and PowerShell but could also be in the form of command-line batch scripts."
                },
                {
                    "ID": "T1035",
                    "Name": "Service Execution",
                    "Description": "Adversaries may execute a binary, command, or script via a method that interacts with Windows services, such as the Service Control Manager. This can be done by either creating a new service or modifying an existing service. This technique is the execution used in conjunction with New Service and Modify Existing Service during service persistence or privilege escalation."
                },
                {
                    "ID": "T1218",
                    "Name": "Signed Binary Proxy Execution",
                    "Description": "Binaries signed with trusted digital certificates can execute on Windows systems protected by digital signature validation. Several Microsoft signed binaries that are default on Windows installations can be used to proxy execution of other files. This behavior may be abused by adversaries to execute malicious files that could bypass application whitelisting and signature validation on systems. This technique accounts for proxy execution methods that are not already accounted for within the existing techniques."
                },
                {
                    "ID": "T1216",
                    "Name": "Signed Script Proxy Execution",
                    "Description": "Scripts signed with trusted certificates can be used to proxy execution of malicious files. This behavior may bypass signature validation restrictions and application whitelisting solutions that do not account for use of these scripts."
                },
                {
                    "ID": "T1153",
                    "Name": "Source",
                    "Description": "The source command loads functions into the current shell or executes files in the current context. This built-in command can be run in two different ways source /path/to/filename [arguments] or . /path/to/filename [arguments]. Take note of the space after the \".\". Without a space, a new shell is created that runs the program instead of running the program within the current context. This is often used to make certain features or functions available to a shell or to update a specific shell's environment. "
                },
                {
                    "ID": "T1151",
                    "Name": "Space after Filename",
                    "Description": "Adversaries can hide a program's true filetype by changing the extension of a file. With certain file types (specifically this does not work with .app extensions), appending a space to the end of a filename will change how the file is processed by the operating system. For example, if there is a Mach-O executable file called evil.bin, when it is double clicked by a user, it will launch Terminal.app and execute. If this file is renamed to evil.txt, then when double clicked by a user, it will launch with the default text editing application (not executing the binary). However, if the file is renamed to \"evil.txt \" (note the space at the end), then when double clicked by a user, the true file type is determined by the OS and handled appropriately and the binary will be executed . "
                },
                {
                    "ID": "T1072",
                    "Name": "Third-party Software",
                    "Description": "Third-party applications and software deployment systems may be in use in the network environment for administration purposes (e.g., SCCM, VNC, HBSS, Altiris, etc.). If an adversary gains access to these systems, then they may be able to execute code."
                },
                {
                    "ID": "T1154",
                    "Name": "Trap",
                    "Description": "The trap command allows programs and shells to specify commands that will be executed upon receiving interrupt signals. A common situation is a script allowing for graceful termination and handling of common  keyboard interrupts like ctrl+c and ctrl+d. Adversaries can use this to register code to be executed when the shell encounters specific interrupts either to gain execution or as a persistence mechanism. Trap commands are of the following format trap 'command list' signals where \"command list\" will be executed when \"signals\" are received."
                },
                {
                    "ID": "T1127",
                    "Name": "Trusted Developer Utilities",
                    "Description": "There are many utilities used for software development related tasks that can be used to execute code in various forms to assist in development, debugging, and reverse engineering. These utilities may often be signed with legitimate certificates that allow them to execute on a system and proxy execution of malicious code through a trusted process that effectively bypasses application whitelisting defensive solutions."
                },
                {
                    "ID": "T1204",
                    "Name": "User Execution",
                    "Description": "An adversary may rely upon specific actions by a user in order to gain execution. This may be direct code execution, such as when a user opens a malicious executable delivered via Spearphishing Attachment with the icon and apparent extension of a document file. It also may lead to other execution techniques, such as when a user clicks on a link delivered via Spearphishing Link that leads to exploitation of a browser or application vulnerability via Exploitation for Client Execution. While User Execution frequently occurs shortly after Initial Access it may occur at other phases of an intrusion, such as when an adversary places a file in a shared directory or on a user's desktop hoping that a user will click on it."
                },
                {
                    "ID": "T1047",
                    "Name": "Windows Management Instrumentation",
                    "Description": "Windows Management Instrumentation (WMI) is a Windows administration feature that provides a uniform environment for local and remote access to Windows system components. It relies on the WMI service for local and remote access and the server message block (SMB)  and Remote Procedure Call Service (RPCS)  for remote access. RPCS operates over port 135. "
                },
                {
                    "ID": "T1028",
                    "Name": "Windows Remote Management",
                    "Description": "Windows Remote Management (WinRM) is the name of both a Windows service and a protocol that allows a user to interact with a remote system (e.g., run an executable, modify the Registry, modify services).  It may be called with the winrm command or by any number of programs such as PowerShell. "
                },
                {
                    "ID": "T1220",
                    "Name": "XSL Script Processing",
                    "Description": "Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. To support complex operations, the XSL standard includes support for embedded scripting in various languages. "
                }
            ]
        },
        "Persistence": {
            "Name": "Persistence",
            "Description": "Persistence is any access, action, or configuration change to a system that gives an adversary a persistent presence on that system. Adversaries will often need to maintain access to systems through interruptions such as system restarts, loss of credentials, or other failures that would require a remote access tool to restart or alternate backdoor for them to regain access.\n                ",
            "ID": "TA0003",
            "Techniques": [
                {
                    "ID": "T1156",
                    "Name": ".bash_profile and .bashrc",
                    "Description": "~/.bash_profile and ~/.bashrc are executed in a user's context when a new shell opens or when a user logs in so that their environment is set correctly. ~/.bash_profile is executed for login shells and ~/.bashrc is executed for interactive non-login shells. This means that when a user logs in (via username and password) to the console (either locally or remotely via something like SSH), ~/.bash_profile is executed before the initial command prompt is returned to the user. After that, every time a new shell is opened, ~/.bashrc is executed. This allows users more fine grained control over when they want certain commands executed."
                },
                {
                    "ID": "T1015",
                    "Name": "Accessibility Features",
                    "Description": "Windows contains accessibility features that may be launched with a key combination before a user has logged in (for example, when the user is on the Windows logon screen). An adversary can modify the way these programs are launched to get a command prompt or backdoor without logging in to the system."
                },
                {
                    "ID": "T1098",
                    "Name": "Account Manipulation",
                    "Description": "Account manipulation may aid adversaries in maintaining access to credentials and certain permission levels within an environment. Manipulation could consist of modifying permissions, modifying credentials, adding or changing permission groups, modifying account settings, or modifying how authentication is performed. These actions could also include account activity designed to subvert security policies, such as performing iterative password updates to subvert password duration policies and preserve the life of compromised credentials. In order to create or manipulate accounts, the adversary must already have sufficient permissions on systems or the domain."
                },
                {
                    "ID": "T1182",
                    "Name": "AppCert DLLs",
                    "Description": "Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs value in the Registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager are loaded into every process that calls the ubiquitously used application programming interface (API) functions: "
                },
                {
                    "ID": "T1103",
                    "Name": "AppInit DLLs",
                    "Description": "Dynamic-link libraries (DLLs) that are specified in the AppInit_DLLs value in the Registry keys HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows or HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows are loaded by user32.dll into every process that loads user32.dll. In practice this is nearly every program, since user32.dll is a very common library.  Similar to Process Injection, these values can be abused to obtain persistence and privilege escalation by causing a malicious DLL to be loaded and run in the context of separate processes on the computer. "
                },
                {
                    "ID": "T1138",
                    "Name": "Application Shimming",
                    "Description": "The Microsoft Windows Application Compatibility Infrastructure/Framework (Application Shim) was created to allow for backward compatibility of software as the operating system codebase changes over time. For example, the application shimming feature allows developers to apply fixes to applications (without rewriting code) that were created for Windows XP so that it will work with Windows 10.  Within the framework, shims are created to act as a buffer between the program (or more specifically, the Import Address Table) and the Windows OS. When a program is executed, the shim cache is referenced to determine if the program requires the use of the shim database (.sdb). If so, the shim database uses Hooking to redirect the code as necessary in order to communicate with the OS. A list of all shims currently installed by the default Windows installer (sdbinst.exe) is kept in:"
                },
                {
                    "ID": "T1131",
                    "Name": "Authentication Package",
                    "Description": "Windows Authentication Package DLLs are loaded by the Local Security Authority (LSA) process at system start. They provide support for multiple logon processes and multiple security protocols to the operating system. "
                },
                {
                    "ID": "T1197",
                    "Name": "BITS Jobs",
                    "Description": "Windows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through Component Object Model (COM).   BITS is commonly used by updaters, messengers, and other applications preferred to operate in the background (using available idle bandwidth) without interrupting other networked applications. File transfer tasks are implemented as BITS jobs, which contain a queue of one or more file operations."
                },
                {
                    "ID": "T1067",
                    "Name": "Bootkit",
                    "Description": "A bootkit is a malware variant that modifies the boot sectors of a hard drive, including the Master Boot Record (MBR) and Volume Boot Record (VBR). "
                },
                {
                    "ID": "T1176",
                    "Name": "Browser Extensions",
                    "Description": "Browser extensions or plugins are small programs that can add functionality and customize aspects of internet browsers. They can be installed directly or through a browser's app store. Extensions generally have access and permissions to everything that the browser can access.  "
                },
                {
                    "ID": "T1042",
                    "Name": "Change Default File Association",
                    "Description": "When a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access   or by administrators using the built-in assoc utility.  Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened."
                },
                {
                    "ID": "T1109",
                    "Name": "Component Firmware",
                    "Description": "Some adversaries may employ sophisticated means to compromise computer components and install malicious firmware that will execute adversary code outside of the operating system and main system firmware or BIOS. This technique may be similar to System Firmware but conducted upon other system components that may not have the same capability or level of integrity checking. Malicious device firmware could provide both a persistent level of access to systems despite potential typical failures to maintain access and hard disk re-images, as well as a way to evade host software-based defenses and integrity checks."
                },
                {
                    "ID": "T1122",
                    "Name": "Component Object Model Hijacking",
                    "Description": "The   (COM) is a system within Windows to enable interaction between software components through the operating system.  Adversaries can use this system to insert malicious code that can be executed in place of legitimate software through hijacking the COM references and relationships as a means for persistence. Hijacking a COM object requires a change in the Windows Registry to replace a reference to a legitimate system component which may cause that component to not work when executed. When that system component is executed through normal system operation the adversary's code will be executed instead.  An adversary is likely to hijack objects that are used frequently enough to maintain a consistent level of persistence, but are unlikely to break noticeable functionality within the system as to avoid system instability that could lead to detection."
                },
                {
                    "ID": "T1136",
                    "Name": "Create Account",
                    "Description": "Adversaries with a sufficient level of access may create a local system or domain account. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system."
                },
                {
                    "ID": "T1038",
                    "Name": "DLL Search Order Hijacking",
                    "Description": "Windows systems use a common method to look for required DLLs to load into a program.  Adversaries may take advantage of the Windows DLL search order and programs that ambiguously specify DLLs to gain privilege escalation and persistence. "
                },
                {
                    "ID": "T1157",
                    "Name": "Dylib Hijacking",
                    "Description": "macOS and OS X use a common method to look for required dynamic libraries (dylib) to load into a program based on search paths. Adversaries can take advantage of ambiguous paths to plant dylibs to gain privilege escalation or persistence."
                },
                {
                    "ID": "T1133",
                    "Name": "External Remote Services",
                    "Description": "Remote services such as VPNs, Citrix, and other access mechanisms allow users to connect to internal enterprise network resources from external locations. There are often remote service gateways that manage connections and credential authentication for these services. Services such as Windows Remote Management can also be used externally."
                },
                {
                    "ID": "T1044",
                    "Name": "File System Permissions Weakness",
                    "Description": "Processes may automatically execute specific binaries as part of their functionality or to perform other actions. If the permissions on the file system directory containing a target binary, or permissions on the binary itself, are improperly set, then the target binary may be overwritten with another binary using user-level permissions and executed by the original process. If the original process and thread are running under a higher permissions level, then the replaced binary will also execute under higher-level permissions, which could include SYSTEM."
                },
                {
                    "ID": "T1158",
                    "Name": "Hidden Files and Directories",
                    "Description": "To prevent normal users from accidentally changing special files on a system, most operating systems have the concept of a ‘hidden’ file. These files don’t show up when a user browses the file system with a GUI or when using normal commands on the command line. Users must explicitly ask to show the hidden files either via a series of Graphical User Interface (GUI) prompts or with command line switches (dir /a for Windows and ls –a for Linux and macOS)."
                },
                {
                    "ID": "T1179",
                    "Name": "Hooking",
                    "Description": "Windows processes often leverage application programming interface (API) functions to perform tasks that require reusable system resources. Windows API functions are typically stored in dynamic-link libraries (DLLs) as exported functions. Hooking involves redirecting calls to these functions and can be implemented via:"
                },
                {
                    "ID": "T1062",
                    "Name": "Hypervisor",
                    "Description": "A type-1 hypervisor is a software layer that sits between the guest operating systems and system's hardware.  It presents a virtual running environment to an operating system. An example of a common hypervisor is Xen.  A type-1 hypervisor operates at a level below the operating system and could be designed with Rootkit functionality to hide its existence from the guest operating system.  A malicious hypervisor of this nature could be used to persist on systems through interruption."
                },
                {
                    "ID": "T1183",
                    "Name": "Image File Execution Options Injection",
                    "Description": "Image File Execution Options (IFEO) enable a developer to attach a debugger to an application. When a process is created, a debugger present in an application’s IFEO will be prepended to the application’s name, effectively launching the new process under the debugger (e.g., \"C:\\dbg\\ntsd.exe -g  notepad.exe\"). "
                },
                {
                    "ID": "T1215",
                    "Name": "Kernel Modules and Extensions",
                    "Description": "Loadable Kernel Modules (or LKMs) are pieces of code that can be loaded and unloaded into the kernel upon demand. They extend the functionality of the kernel without the need to reboot the system. For example, one type of module is the device driver, which allows the kernel to access hardware connected to the system.  When used maliciously, Loadable Kernel Modules (LKMs) can be a type of kernel-mode Rootkit that run with the highest operating system privilege (Ring 0).  Adversaries can use loadable kernel modules to covertly persist on a system and evade defenses. Examples have been found in the wild and there are some open source projects.    "
                },
                {
                    "ID": "T1159",
                    "Name": "Launch Agent",
                    "Description": "Per Apple’s developer documentation, when a user logs in, a per-user launchd process is started which loads the parameters for each launch-on-demand user agent from the property list (plist) files found in /System/Library/LaunchAgents, /Library/LaunchAgents, and $HOME/Library/LaunchAgents   . These launch agents have property list files which point to the executables that will be launched ."
                },
                {
                    "ID": "T1160",
                    "Name": "Launch Daemon",
                    "Description": "Per Apple’s developer documentation, when macOS and OS X boot up, launchd is run to finish system initialization. This process loads the parameters for each launch-on-demand system-level daemon from the property list (plist) files found in /System/Library/LaunchDaemons and /Library/LaunchDaemons . These LaunchDaemons have property list files which point to the executables that will be launched ."
                },
                {
                    "ID": "T1152",
                    "Name": "Launchctl",
                    "Description": "Launchctl controls the macOS launchd process which handles things like launch agents and launch daemons, but can execute other commands or programs itself. Launchctl supports taking subcommands on the command-line, interactively, or even redirected from standard input. By loading or reloading launch agents or launch daemons, adversaries can install persistence or execute changes they made  . Running a command from launchctl is as simple as launchctl submit -l  -- /Path/to/thing/to/execute \"arg\" \"arg\" \"arg\". Loading, unloading, or reloading launch agents or launch daemons can require elevated privileges. "
                },
                {
                    "ID": "T1161",
                    "Name": "LC_LOAD_DYLIB Addition",
                    "Description": "Mach-O binaries have a series of headers that are used to perform certain operations when a binary is loaded. The LC_LOAD_DYLIB header in a Mach-O binary tells macOS and OS X which dynamic libraries (dylibs) to load during execution time. These can be added ad-hoc to the compiled binary as long adjustments are made to the rest of the fields and dependencies . There are tools available to perform these changes. Any changes will invalidate digital signatures on binaries because the binary is being modified. Adversaries can remediate this issue by simply removing the LC_CODE_SIGNATURE command from the binary so that the signature isn’t checked at load time ."
                },
                {
                    "ID": "T1168",
                    "Name": "Local Job Scheduling",
                    "Description": "On Linux and macOS systems, multiple methods are supported for creating pre-scheduled and periodic background jobs: cron,  at,  and launchd.  Unlike Scheduled Task on Windows systems, job scheduling on Linux-based systems cannot be done remotely unless used in conjunction within an established remote session, like secure shell (SSH)."
                },
                {
                    "ID": "T1162",
                    "Name": "Login Item",
                    "Description": "MacOS provides the option to list specific applications to run when a user logs in. These applications run under the logged in user's context, and will be started every time the user logs in. Login items installed using the Service Management Framework are not visible in the System Preferences and can only be removed by the application that created them . Users have direct control over login items installed using a shared file list which are also visible in System Preferences . These login items are stored in the user's ~/Library/Preferences/ directory in a plist file called com.apple.loginitems.plist . Some of these applications can open visible dialogs to the user, but they don’t all have to since there is an option to ‘Hide’ the window. If an adversary can register their own login item or modified an existing one, then they can use it to execute their code for a persistence mechanism each time the user logs in  . The API method  SMLoginItemSetEnabled  can be used to set Login Items, but scripting languages like AppleScript can do this as well  ."
                },
                {
                    "ID": "T1037",
                    "Name": "Logon Scripts",
                    "Description": "Windows allows logon scripts to be run whenever a specific user or group of users log into a system.  The scripts can be used to perform administrative functions, which may often execute other programs or send information to an internal logging server."
                },
                {
                    "ID": "T1177",
                    "Name": "LSASS Driver",
                    "Description": "The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain. The Local Security Authority (LSA) is the main component responsible for local security policy and user authentication. The LSA includes multiple dynamic link libraries (DLLs) associated with various other security functions, all of which run in the context of the LSA Subsystem Service (LSASS) lsass.exe process. "
                },
                {
                    "ID": "T1031",
                    "Name": "Modify Existing Service",
                    "Description": "Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Registry. Service configurations can be modified using utilities such as sc.exe and Reg."
                },
                {
                    "ID": "T1128",
                    "Name": "Netsh Helper DLL",
                    "Description": "Netsh.exe (also referred to as Netshell) is a command-line scripting utility used to interact with the network configuration of a system. It contains functionality to add helper DLLs for extending functionality of the utility.  The paths to registered netsh.exe helper DLLs are entered into the Windows Registry at HKLM\\SOFTWARE\\Microsoft\\Netsh."
                },
                {
                    "ID": "T1050",
                    "Name": "New Service",
                    "Description": "When operating systems boot up, they can start programs or applications called services that perform background system functions.  A service's configuration information, including the file path to the service's executable, is stored in the Windows Registry. "
                },
                {
                    "ID": "T1137",
                    "Name": "Office Application Startup",
                    "Description": "Microsoft Office is a fairly common application suite on Windows-based operating systems within an enterprise network. There are multiple mechanisms that can be used with Office for persistence when an Office-based application is started."
                },
                {
                    "ID": "T1034",
                    "Name": "Path Interception",
                    "Description": "Path interception occurs when an executable is placed in a specific path so that it is executed by an application instead of the intended target. One example of this was the use of a copy of cmd in the current working directory of a vulnerable application that loads a CMD or BAT file with the CreateProcess function. "
                },
                {
                    "ID": "T1150",
                    "Name": "Plist Modification",
                    "Description": "Property list (plist) files contain all of the information that macOS and OS X uses to configure applications and services. These files are UTF-8 encoded and formatted like XML documents via a series of keys surrounded by < >. They detail when programs should execute, file paths to the executables, program arguments, required OS permissions, and many others. plists are located in certain locations depending on their purpose such as /Library/Preferences (which execute with elevated privileges) and ~/Library/Preferences (which execute with a user's privileges). "
                },
                {
                    "ID": "T1205",
                    "Name": "Port Knocking",
                    "Description": "Port Knocking is a well-established method used by both defenders and adversaries to hide open ports from access. To enable a port, an adversary sends a series of packets with certain characteristics before the port will be opened. Usually this series of packets consists of attempted connections to a predefined sequence of closed ports, but can involve unusual flags, specific strings or other unique characteristics. After the sequence is completed, opening a port is often accomplished by the host based firewall, but could also be implemented by custom software. "
                },
                {
                    "ID": "T1013",
                    "Name": "Port Monitors",
                    "Description": "A port monitor can be set through the   API call to set a DLL to be loaded at startup.  This DLL can be located in C:\\Windows\\System32 and will be loaded by the print spooler service, spoolsv.exe, on boot. The spoolsv.exe process also runs under SYSTEM level permissions.  Alternatively, an arbitrary DLL can be loaded if permissions allow writing a fully-qualified pathname for that DLL to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors. The Registry key contains entries for the following:"
                },
                {
                    "ID": "T1163",
                    "Name": "Rc.common",
                    "Description": "During the boot process, macOS executes source /etc/rc.common, which is a shell script containing various utility functions. This file also defines routines for processing command-line arguments and for gathering system settings, and is thus recommended to include in the start of Startup Item Scripts . In macOS and OS X, this is now a deprecated technique in favor of launch agents and launch daemons, but is currently still used."
                },
                {
                    "ID": "T1164",
                    "Name": "Re-opened Applications",
                    "Description": "Starting in Mac OS X 10.7 (Lion), users can specify certain applications to be re-opened when a user reboots their machine. While this is usually done via a Graphical User Interface (GUI) on an app-by-app basis, there are property list files (plist) that contain this information as well located at ~/Library/Preferences/com.apple.loginwindow.plist and ~/Library/Preferences/ByHost/com.apple.loginwindow.* .plist. "
                },
                {
                    "ID": "T1108",
                    "Name": "Redundant Access",
                    "Description": "Adversaries may use more than one remote access tool with varying command and control protocols as a hedge against detection. If one type of tool is detected and blocked or removed as a response but the organization did not gain a full understanding of the adversary's tools and access, then the adversary will be able to retain access to the network. Adversaries may also attempt to gain access to Valid Accounts to use External Remote Services such as external VPNs as a way to maintain access despite interruptions to remote access tools deployed within a target network. "
                },
                {
                    "ID": "T1060",
                    "Name": "Registry Run Keys / Startup Folder",
                    "Description": "Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in.  These programs will be executed under the context of the user and will have the account's associated permissions level."
                },
                {
                    "ID": "T1053",
                    "Name": "Scheduled Task",
                    "Description": "Utilities such as at and schtasks, along with the Windows Task Scheduler, can be used to schedule programs or scripts to be executed at a date and time. A task can also be scheduled on a remote system, provided the proper authentication is met to use RPC and file and printer sharing is turned on. Scheduling a task on a remote system typically required being a member of the Administrators group on the the remote system. "
                },
                {
                    "ID": "T1180",
                    "Name": "Screensaver",
                    "Description": "Screensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension.  The Windows screensaver application scrnsave.exe is located in C:\\Windows\\System32\\ along with screensavers included with base Windows installations. The following screensaver settings are stored in the Registry (HKCU\\Control Panel\\Desktop\\) and could be manipulated to achieve persistence:"
                },
                {
                    "ID": "T1101",
                    "Name": "Security Support Provider",
                    "Description": "Windows Security Support Provider (SSP) DLLs are loaded into the Local Security Authority (LSA) process at system start. Once loaded into the LSA, SSP DLLs have access to encrypted and plaintext passwords that are stored in Windows, such as any logged-on user's Domain password or smart card PINs. The SSP configuration is stored in two Registry keys: HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages and HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\OSConfig\\Security Packages. An adversary may modify these Registry keys to add new SSPs, which will be loaded the next time the system boots, or when the AddSecurityPackage Windows API function is called."
                },
                {
                    "ID": "T1058",
                    "Name": "Service Registry Permissions Weakness",
                    "Description": "Windows stores local service configuration information in the Registry under HKLM\\SYSTEM\\CurrentControlSet\\Services. The information stored under a service's Registry keys can be manipulated to modify a service's execution parameters through tools such as the service controller, sc.exe, PowerShell, or Reg. Access to Registry keys is controlled through Access Control Lists and permissions. "
                },
                {
                    "ID": "T1166",
                    "Name": "Setuid and Setgid",
                    "Description": "When the setuid or setgid bits are set on Linux or macOS for an application, this means that the application will run with the privileges of the owning user or group respectively  . Normally an application is run in the current user’s context, regardless of which user or group owns the application. There are instances where programs need to be executed in an elevated context to function properly, but the user running them doesn’t need the elevated privileges. Instead of creating an entry in the sudoers file, which must be done by root, any user can specify the setuid or setgid flag to be set for their own applications. These bits are indicated with an \"s\" instead of an \"x\" when viewing a file's attributes via ls -l. The chmod program can set these bits with via bitmasking, chmod 4777 [file] or via shorthand naming, chmod u+s [file]."
                },
                {
                    "ID": "T1023",
                    "Name": "Shortcut Modification",
                    "Description": "Shortcuts or symbolic links are ways of referencing other files or programs that will be opened or executed when the shortcut is clicked or executed by a system startup process. Adversaries could use shortcuts to execute their tools for persistence. They may create a new shortcut as a means of indirection that may use Masquerading to look like a legitimate program. Adversaries could also edit the target path or entirely replace an existing shortcut so their tools will be executed instead of the intended legitimate program."
                },
                {
                    "ID": "T1198",
                    "Name": "SIP and Trust Provider Hijacking",
                    "Description": "In user mode, Windows Authenticode  digital signatures are used to verify a file's origin and integrity, variables that may be used to establish trust in signed code (ex: a driver with a valid Microsoft signature may be handled as safe). The signature validation process is handled via the WinVerifyTrust application programming interface (API) function,   which accepts an inquiry and coordinates with the appropriate trust provider, which is responsible for validating parameters of a signature. "
                },
                {
                    "ID": "T1165",
                    "Name": "Startup Items",
                    "Description": "Per Apple’s documentation, startup items execute during the final phase of the boot process and contain shell scripts or other executable files along with configuration information used by the system to determine the execution order for all startup items . This is technically a deprecated version (superseded by Launch Daemons), and thus the appropriate folder, /Library/StartupItems isn’t guaranteed to exist on the system by default, but does appear to exist by default on macOS Sierra. A startup item is a directory whose executable and configuration property list (plist), StartupParameters.plist, reside in the top-level directory. "
                },
                {
                    "ID": "T1019",
                    "Name": "System Firmware",
                    "Description": "The BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) or Extensible Firmware Interface (EFI) are examples of system firmware that operate as the software interface between the operating system and hardware of a computer.   "
                },
                {
                    "ID": "T1209",
                    "Name": "Time Providers",
                    "Description": "The Windows Time service (W32Time) enables time synchronization across and within domains.  W32Time time providers are responsible for retrieving time stamps from hardware/network resources and outputting these values to other network clients. "
                },
                {
                    "ID": "T1154",
                    "Name": "Trap",
                    "Description": "The trap command allows programs and shells to specify commands that will be executed upon receiving interrupt signals. A common situation is a script allowing for graceful termination and handling of common  keyboard interrupts like ctrl+c and ctrl+d. Adversaries can use this to register code to be executed when the shell encounters specific interrupts either to gain execution or as a persistence mechanism. Trap commands are of the following format trap 'command list' signals where \"command list\" will be executed when \"signals\" are received."
                },
                {
                    "ID": "T1078",
                    "Name": "Valid Accounts",
                    "Description": "Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. "
                },
                {
                    "ID": "T1100",
                    "Name": "Web Shell",
                    "Description": "A Web shell is a Web script that is placed on an openly accessible Web server to allow an adversary to use the Web server as a gateway into a network. A Web shell may provide a set of functions to execute or a command-line interface on the system that hosts the Web server. In addition to a server-side script, a Web shell may have a client interface program that is used to talk to the Web server (see, for example, China Chopper Web shell client). "
                },
                {
                    "ID": "T1084",
                    "Name": "Windows Management Instrumentation Event Subscription",
                    "Description": "Windows Management Instrumentation (WMI) can be used to install event filters, providers, consumers, and bindings that execute code when a defined event occurs. Adversaries may use the capabilities of WMI to subscribe to an event and execute arbitrary code when that event occurs, providing persistence on a system. Adversaries may attempt to evade detection of this technique by compiling WMI scripts.  Examples of events that may be subscribed to are the wall clock time or the computer's uptime.  Several threat groups have reportedly used this technique to maintain persistence. "
                },
                {
                    "ID": "T1004",
                    "Name": "Winlogon Helper DLL",
                    "Description": "Winlogon.exe is a Windows component responsible for actions at logon/logoff as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete. Registry entries in HKLM\\Software[Wow6432Node]Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\ and HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\ are used to manage additional helper programs and functionalities that support Winlogon.  "
                }
            ]
        },
        "Privilege Escalation": {
            "Name": "Privilege Escalation",
            "Description": "Privilege escalation is the result of actions that allows an adversary to obtain a higher level of permissions on a system or network. Certain tools or actions require a higher level of privilege to work and are likely necessary at many points throughout an operation. Adversaries can enter a system with unprivileged access and must take advantage of a system weakness to obtain local administrator or SYSTEM/root level privileges. A user account with administrator-like access can also be used. User accounts with permissions to access specific systems or perform specific functions necessary for adversaries to achieve their objective may also be considered an escalation of privilege.\n                ",
            "ID": "TA0004",
            "Techniques": [
                {
                    "ID": "T1134",
                    "Name": "Access Token Manipulation",
                    "Description": "Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token. For example, Microsoft promotes the use of access tokens as a security best practice. Administrators should log in as a standard user but run their tools with administrator privileges using the built-in access token manipulation command runas. "
                },
                {
                    "ID": "T1015",
                    "Name": "Accessibility Features",
                    "Description": "Windows contains accessibility features that may be launched with a key combination before a user has logged in (for example, when the user is on the Windows logon screen). An adversary can modify the way these programs are launched to get a command prompt or backdoor without logging in to the system."
                },
                {
                    "ID": "T1182",
                    "Name": "AppCert DLLs",
                    "Description": "Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs value in the Registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager are loaded into every process that calls the ubiquitously used application programming interface (API) functions: "
                },
                {
                    "ID": "T1103",
                    "Name": "AppInit DLLs",
                    "Description": "Dynamic-link libraries (DLLs) that are specified in the AppInit_DLLs value in the Registry keys HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows or HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows are loaded by user32.dll into every process that loads user32.dll. In practice this is nearly every program, since user32.dll is a very common library.  Similar to Process Injection, these values can be abused to obtain persistence and privilege escalation by causing a malicious DLL to be loaded and run in the context of separate processes on the computer. "
                },
                {
                    "ID": "T1138",
                    "Name": "Application Shimming",
                    "Description": "The Microsoft Windows Application Compatibility Infrastructure/Framework (Application Shim) was created to allow for backward compatibility of software as the operating system codebase changes over time. For example, the application shimming feature allows developers to apply fixes to applications (without rewriting code) that were created for Windows XP so that it will work with Windows 10.  Within the framework, shims are created to act as a buffer between the program (or more specifically, the Import Address Table) and the Windows OS. When a program is executed, the shim cache is referenced to determine if the program requires the use of the shim database (.sdb). If so, the shim database uses Hooking to redirect the code as necessary in order to communicate with the OS. A list of all shims currently installed by the default Windows installer (sdbinst.exe) is kept in:"
                },
                {
                    "ID": "T1088",
                    "Name": "Bypass User Account Control",
                    "Description": "Windows User Account Control (UAC) allows a program to elevate its privileges to perform a task under administrator-level permissions by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action. "
                },
                {
                    "ID": "T1038",
                    "Name": "DLL Search Order Hijacking",
                    "Description": "Windows systems use a common method to look for required DLLs to load into a program.  Adversaries may take advantage of the Windows DLL search order and programs that ambiguously specify DLLs to gain privilege escalation and persistence. "
                },
                {
                    "ID": "T1157",
                    "Name": "Dylib Hijacking",
                    "Description": "macOS and OS X use a common method to look for required dynamic libraries (dylib) to load into a program based on search paths. Adversaries can take advantage of ambiguous paths to plant dylibs to gain privilege escalation or persistence."
                },
                {
                    "ID": "T1068",
                    "Name": "Exploitation for Privilege Escalation",
                    "Description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Security constructs such as permission levels will often hinder access to information and use of certain techniques, so adversaries will likely need to perform Privilege Escalation to include use of software exploitation to circumvent those restrictions."
                },
                {
                    "ID": "T1181",
                    "Name": "Extra Window Memory Injection",
                    "Description": "Before creating a window, graphical Windows-based processes must prescribe to or register a windows class, which stipulate appearance and behavior (via windows procedures, which are functions that handle input/output of data).  Registration of new windows classes can include a request for up to 40 bytes of extra window memory (EWM) to be appended to the allocated memory of each instance of that class. This EWM is intended to store data specific to that window and has specific application programming interface (API) functions to set and get its value.  "
                },
                {
                    "ID": "T1044",
                    "Name": "File System Permissions Weakness",
                    "Description": "Processes may automatically execute specific binaries as part of their functionality or to perform other actions. If the permissions on the file system directory containing a target binary, or permissions on the binary itself, are improperly set, then the target binary may be overwritten with another binary using user-level permissions and executed by the original process. If the original process and thread are running under a higher permissions level, then the replaced binary will also execute under higher-level permissions, which could include SYSTEM."
                },
                {
                    "ID": "T1179",
                    "Name": "Hooking",
                    "Description": "Windows processes often leverage application programming interface (API) functions to perform tasks that require reusable system resources. Windows API functions are typically stored in dynamic-link libraries (DLLs) as exported functions. Hooking involves redirecting calls to these functions and can be implemented via:"
                },
                {
                    "ID": "T1183",
                    "Name": "Image File Execution Options Injection",
                    "Description": "Image File Execution Options (IFEO) enable a developer to attach a debugger to an application. When a process is created, a debugger present in an application’s IFEO will be prepended to the application’s name, effectively launching the new process under the debugger (e.g., \"C:\\dbg\\ntsd.exe -g  notepad.exe\"). "
                },
                {
                    "ID": "T1160",
                    "Name": "Launch Daemon",
                    "Description": "Per Apple’s developer documentation, when macOS and OS X boot up, launchd is run to finish system initialization. This process loads the parameters for each launch-on-demand system-level daemon from the property list (plist) files found in /System/Library/LaunchDaemons and /Library/LaunchDaemons . These LaunchDaemons have property list files which point to the executables that will be launched ."
                },
                {
                    "ID": "T1050",
                    "Name": "New Service",
                    "Description": "When operating systems boot up, they can start programs or applications called services that perform background system functions.  A service's configuration information, including the file path to the service's executable, is stored in the Windows Registry. "
                },
                {
                    "ID": "T1034",
                    "Name": "Path Interception",
                    "Description": "Path interception occurs when an executable is placed in a specific path so that it is executed by an application instead of the intended target. One example of this was the use of a copy of cmd in the current working directory of a vulnerable application that loads a CMD or BAT file with the CreateProcess function. "
                },
                {
                    "ID": "T1150",
                    "Name": "Plist Modification",
                    "Description": "Property list (plist) files contain all of the information that macOS and OS X uses to configure applications and services. These files are UTF-8 encoded and formatted like XML documents via a series of keys surrounded by < >. They detail when programs should execute, file paths to the executables, program arguments, required OS permissions, and many others. plists are located in certain locations depending on their purpose such as /Library/Preferences (which execute with elevated privileges) and ~/Library/Preferences (which execute with a user's privileges). "
                },
                {
                    "ID": "T1013",
                    "Name": "Port Monitors",
                    "Description": "A port monitor can be set through the   API call to set a DLL to be loaded at startup.  This DLL can be located in C:\\Windows\\System32 and will be loaded by the print spooler service, spoolsv.exe, on boot. The spoolsv.exe process also runs under SYSTEM level permissions.  Alternatively, an arbitrary DLL can be loaded if permissions allow writing a fully-qualified pathname for that DLL to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors. The Registry key contains entries for the following:"
                },
                {
                    "ID": "T1055",
                    "Name": "Process Injection",
                    "Description": "Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process."
                },
                {
                    "ID": "T1053",
                    "Name": "Scheduled Task",
                    "Description": "Utilities such as at and schtasks, along with the Windows Task Scheduler, can be used to schedule programs or scripts to be executed at a date and time. A task can also be scheduled on a remote system, provided the proper authentication is met to use RPC and file and printer sharing is turned on. Scheduling a task on a remote system typically required being a member of the Administrators group on the the remote system. "
                },
                {
                    "ID": "T1058",
                    "Name": "Service Registry Permissions Weakness",
                    "Description": "Windows stores local service configuration information in the Registry under HKLM\\SYSTEM\\CurrentControlSet\\Services. The information stored under a service's Registry keys can be manipulated to modify a service's execution parameters through tools such as the service controller, sc.exe, PowerShell, or Reg. Access to Registry keys is controlled through Access Control Lists and permissions. "
                },
                {
                    "ID": "T1166",
                    "Name": "Setuid and Setgid",
                    "Description": "When the setuid or setgid bits are set on Linux or macOS for an application, this means that the application will run with the privileges of the owning user or group respectively  . Normally an application is run in the current user’s context, regardless of which user or group owns the application. There are instances where programs need to be executed in an elevated context to function properly, but the user running them doesn’t need the elevated privileges. Instead of creating an entry in the sudoers file, which must be done by root, any user can specify the setuid or setgid flag to be set for their own applications. These bits are indicated with an \"s\" instead of an \"x\" when viewing a file's attributes via ls -l. The chmod program can set these bits with via bitmasking, chmod 4777 [file] or via shorthand naming, chmod u+s [file]."
                },
                {
                    "ID": "T1178",
                    "Name": "SID-History Injection",
                    "Description": "The Windows security identifier (SID) is a unique value that identifies a user or group account. SIDs are used by Windows security in both security descriptors and access tokens.  An account can hold additional SIDs in the SID-History Active Directory attribute , allowing inter-operable account migration between domains (e.g., all values in SID-History are included in access tokens)."
                },
                {
                    "ID": "T1165",
                    "Name": "Startup Items",
                    "Description": "Per Apple’s documentation, startup items execute during the final phase of the boot process and contain shell scripts or other executable files along with configuration information used by the system to determine the execution order for all startup items . This is technically a deprecated version (superseded by Launch Daemons), and thus the appropriate folder, /Library/StartupItems isn’t guaranteed to exist on the system by default, but does appear to exist by default on macOS Sierra. A startup item is a directory whose executable and configuration property list (plist), StartupParameters.plist, reside in the top-level directory. "
                },
                {
                    "ID": "T1169",
                    "Name": "Sudo",
                    "Description": "The sudoers file, /etc/sudoers, describes which users can run which commands and from which terminals. This also describes which commands users can run as other users or groups. This provides the idea of least privilege such that users are running in their lowest possible permissions for most of the time and only elevate to other users or permissions as needed, typically by prompting for a password. However, the sudoers file can also specify when to not prompt users for passwords with a line like user1 ALL=(ALL) NOPASSWD: ALL . "
                },
                {
                    "ID": "T1206",
                    "Name": "Sudo Caching",
                    "Description": "The sudo command \"allows a system administrator to delegate authority to give certain users (or groups of users) the ability to run some (or all) commands as root or another user while providing an audit trail of the commands and their arguments.\"  Since sudo was made for the system administrator, it has some useful configuration features such as a timestamp_timeout that is the amount of time in minutes between instances of sudo before it will re-prompt for a password. This is because sudo has the ability to cache credentials for a period of time. Sudo creates (or touches) a file at /var/db/sudo with a timestamp of when sudo was last run to determine this timeout. Additionally, there is a tty_tickets variable that treats each new tty (terminal session) in isolation. This means that, for example, the sudo timeout of one tty will not affect another tty (you will have to type the password again)."
                },
                {
                    "ID": "T1078",
                    "Name": "Valid Accounts",
                    "Description": "Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. "
                },
                {
                    "ID": "T1100",
                    "Name": "Web Shell",
                    "Description": "A Web shell is a Web script that is placed on an openly accessible Web server to allow an adversary to use the Web server as a gateway into a network. A Web shell may provide a set of functions to execute or a command-line interface on the system that hosts the Web server. In addition to a server-side script, a Web shell may have a client interface program that is used to talk to the Web server (see, for example, China Chopper Web shell client). "
                }
            ]
        },
        "Defense Evasion": {
            "Name": "Defense Evasion",
            "Description": "Defense evasion consists of techniques an adversary may use to evade detection or avoid other defenses. Sometimes these actions are the same as or variations of techniques in other categories that have the added benefit of subverting a particular defense or mitigation. Defense evasion may be considered a set of attributes the adversary applies to all other phases of the operation.\n                ",
            "ID": "TA0005",
            "Techniques": [
                {
                    "ID": "T1134",
                    "Name": "Access Token Manipulation",
                    "Description": "Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token. For example, Microsoft promotes the use of access tokens as a security best practice. Administrators should log in as a standard user but run their tools with administrator privileges using the built-in access token manipulation command runas. "
                },
                {
                    "ID": "T1009",
                    "Name": "Binary Padding",
                    "Description": "Some security tools inspect files with static signatures to determine if they are known malicious. Adversaries may add data to files to increase the size beyond what security tools are capable of handling or to change the file hash to avoid hash-based blacklists."
                },
                {
                    "ID": "T1197",
                    "Name": "BITS Jobs",
                    "Description": "Windows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through Component Object Model (COM).   BITS is commonly used by updaters, messengers, and other applications preferred to operate in the background (using available idle bandwidth) without interrupting other networked applications. File transfer tasks are implemented as BITS jobs, which contain a queue of one or more file operations."
                },
                {
                    "ID": "T1088",
                    "Name": "Bypass User Account Control",
                    "Description": "Windows User Account Control (UAC) allows a program to elevate its privileges to perform a task under administrator-level permissions by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action. "
                },
                {
                    "ID": "T1146",
                    "Name": "Clear Command History",
                    "Description": "macOS and Linux both keep track of the commands users type in their terminal so that users can easily remember what they've done. These logs can be accessed in a few different ways. While logged in, this command history is tracked in a file pointed to by the environment variable HISTFILE. When a user logs off a system, this information is flushed to a file in the user's home directory called ~/.bash_history. The benefit of this is that it allows users to go back to commands they've used before in different sessions. Since everything typed on the command-line is saved, passwords passed in on the command line are also saved. Adversaries can abuse this by searching these files for cleartext passwords. Additionally, adversaries can use a variety of methods to prevent their own commands from appear in these logs such as unset HISTFILE, export HISTFILESIZE=0, history -c, rm ~/.bash_history."
                },
                {
                    "ID": "T1191",
                    "Name": "CMSTP",
                    "Description": "The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a command-line program used to install Connection Manager service profiles.  CMSTP.exe accepts an installation information file (INF) as a parameter and installs a service profile leveraged for remote access connections."
                },
                {
                    "ID": "T1116",
                    "Name": "Code Signing",
                    "Description": "Code signing provides a level of authenticity on a binary from the developer and a guarantee that the binary has not been tampered with.  However, adversaries are known to use code signing certificates to masquerade malware and tools as legitimate binaries . The certificates used during an operation may be created, forged, or stolen by the adversary.  "
                },
                {
                    "ID": "T1223",
                    "Name": "Compiled HTML File",
                    "Description": "Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system. CHM files are compressed compilations of various content such as HTML documents, images, and scripting/web related programming languages such VBA, JScript, Java, and ActiveX.  CHM content is displayed using underlying components of the Internet Explorer browser  loaded by the HTML Help executable program (hh.exe). "
                },
                {
                    "ID": "T1109",
                    "Name": "Component Firmware",
                    "Description": "Some adversaries may employ sophisticated means to compromise computer components and install malicious firmware that will execute adversary code outside of the operating system and main system firmware or BIOS. This technique may be similar to System Firmware but conducted upon other system components that may not have the same capability or level of integrity checking. Malicious device firmware could provide both a persistent level of access to systems despite potential typical failures to maintain access and hard disk re-images, as well as a way to evade host software-based defenses and integrity checks."
                },
                {
                    "ID": "T1122",
                    "Name": "Component Object Model Hijacking",
                    "Description": "The   (COM) is a system within Windows to enable interaction between software components through the operating system.  Adversaries can use this system to insert malicious code that can be executed in place of legitimate software through hijacking the COM references and relationships as a means for persistence. Hijacking a COM object requires a change in the Windows Registry to replace a reference to a legitimate system component which may cause that component to not work when executed. When that system component is executed through normal system operation the adversary's code will be executed instead.  An adversary is likely to hijack objects that are used frequently enough to maintain a consistent level of persistence, but are unlikely to break noticeable functionality within the system as to avoid system instability that could lead to detection."
                },
                {
                    "ID": "T1196",
                    "Name": "Control Panel Items",
                    "Description": "Windows Control Panel items are utilities that allow users to view and adjust computer settings. Control Panel items are registered executable (.exe) or Control Panel (.cpl) files, the latter are actually renamed dynamic-link library (.dll) files that export a CPlApplet function.   Control Panel items can be executed directly from the command line, programmatically via an application programming interface (API) call, or by simply double-clicking the file.   "
                },
                {
                    "ID": "T1207",
                    "Name": "DCShadow",
                    "Description": "DCShadow is a method of manipulating Active Directory (AD) data, including objects and schemas, by registering (or reusing an inactive registration) and simulating the behavior of a Domain Controller (DC).   Once registered, a rogue DC may be able to inject and replicate changes into AD infrastructure for any domain object, including credentials and keys."
                },
                {
                    "ID": "T1140",
                    "Name": "Deobfuscate/Decode Files or Information",
                    "Description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware, Scripting, PowerShell, or by using utilities present on the system."
                },
                {
                    "ID": "T1089",
                    "Name": "Disabling Security Tools",
                    "Description": "Adversaries may disable security tools to avoid possible detection of their tools and activities. This can take the form of killing security software or event logging processes, deleting Registry keys so that tools do not start at run time, or other methods to interfere with security scanning or event reporting."
                },
                {
                    "ID": "T1038",
                    "Name": "DLL Search Order Hijacking",
                    "Description": "Windows systems use a common method to look for required DLLs to load into a program.  Adversaries may take advantage of the Windows DLL search order and programs that ambiguously specify DLLs to gain privilege escalation and persistence. "
                },
                {
                    "ID": "T1073",
                    "Name": "DLL Side-Loading",
                    "Description": "Programs may specify DLLs that are loaded at runtime. Programs that improperly or vaguely specify a required DLL may be open to a vulnerability in which an unintended DLL is loaded. Side-loading vulnerabilities specifically occur when Windows Side-by-Side (WinSxS) manifests  are not explicit enough about characteristics of the DLL to be loaded. Adversaries may take advantage of a legitimate program that is vulnerable to side-loading to load a malicious DLL. "
                },
                {
                    "ID": "T1211",
                    "Name": "Exploitation for Defense Evasion",
                    "Description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Vulnerabilities may exist in defensive security software that can be used to disable or circumvent them."
                },
                {
                    "ID": "T1181",
                    "Name": "Extra Window Memory Injection",
                    "Description": "Before creating a window, graphical Windows-based processes must prescribe to or register a windows class, which stipulate appearance and behavior (via windows procedures, which are functions that handle input/output of data).  Registration of new windows classes can include a request for up to 40 bytes of extra window memory (EWM) to be appended to the allocated memory of each instance of that class. This EWM is intended to store data specific to that window and has specific application programming interface (API) functions to set and get its value.  "
                },
                {
                    "ID": "T1107",
                    "Name": "File Deletion",
                    "Description": "Malware, tools, or other non-native files dropped or created on a system by an adversary may leave traces behind as to what was done within a network and how. Adversaries may remove these files over the course of an intrusion to keep their footprint low or remove them at the end as part of the post-intrusion cleanup process."
                },
                {
                    "ID": "T1222",
                    "Name": "File Permissions Modification",
                    "Description": "File permissions are commonly managed by discretionary access control lists (DACLs) specified by the file owner. File DACL implementation may vary by platform, but generally explicitly designate which users/groups can perform which actions (ex: read, write, execute, etc.).   "
                },
                {
                    "ID": "T1006",
                    "Name": "File System Logical Offsets",
                    "Description": "Windows allows programs to have direct access to logical volumes. Programs with direct access may read and write files directly from the drive by analyzing file system data structures. This technique bypasses Windows file access controls as well as file system monitoring tools. "
                },
                {
                    "ID": "T1144",
                    "Name": "Gatekeeper Bypass",
                    "Description": "In macOS and OS X, when applications or programs are downloaded from the internet, there is a special attribute set on the file called com.apple.quarantine. This attribute is read by Apple's Gatekeeper defense program at execution time and provides a prompt to the user to allow or deny execution. "
                },
                {
                    "ID": "T1158",
                    "Name": "Hidden Files and Directories",
                    "Description": "To prevent normal users from accidentally changing special files on a system, most operating systems have the concept of a ‘hidden’ file. These files don’t show up when a user browses the file system with a GUI or when using normal commands on the command line. Users must explicitly ask to show the hidden files either via a series of Graphical User Interface (GUI) prompts or with command line switches (dir /a for Windows and ls –a for Linux and macOS)."
                },
                {
                    "ID": "T1147",
                    "Name": "Hidden Users",
                    "Description": "Every user account in macOS has a userID associated with it. When creating a user, you can specify the userID for that account. There is a property value in /Library/Preferences/com.apple.loginwindow called Hide500Users that prevents users with userIDs 500 and lower from appearing at the login screen. By using the Create Account technique with a userID under 500 and enabling this property (setting it to Yes), an adversary can hide their user accounts much more easily: sudo dscl . -create /Users/username UniqueID 401 ."
                },
                {
                    "ID": "T1143",
                    "Name": "Hidden Window",
                    "Description": "The configurations for how applications run on macOS and OS X are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock. However, adversaries can abuse this feature and hide their running window  ."
                },
                {
                    "ID": "T1148",
                    "Name": "HISTCONTROL",
                    "Description": "The HISTCONTROL environment variable keeps track of what should be saved by the history command and eventually into the ~/.bash_history file when a user logs out. This setting can be configured to ignore commands that start with a space by simply setting it to \"ignorespace\". HISTCONTROL can also be set to ignore duplicate commands by setting it to \"ignoredups\". In some Linux systems, this is set by default to \"ignoreboth\" which covers both of the previous examples. This means that \" ls\" will not be saved, but \"ls\" would be saved by history. HISTCONTROL does not exist by default on macOS, but can be set by the user and will be respected. Adversaries can use this to operate without leaving traces by simply prepending a space to all of their terminal commands."
                },
                {
                    "ID": "T1183",
                    "Name": "Image File Execution Options Injection",
                    "Description": "Image File Execution Options (IFEO) enable a developer to attach a debugger to an application. When a process is created, a debugger present in an application’s IFEO will be prepended to the application’s name, effectively launching the new process under the debugger (e.g., \"C:\\dbg\\ntsd.exe -g  notepad.exe\"). "
                },
                {
                    "ID": "T1054",
                    "Name": "Indicator Blocking",
                    "Description": "An adversary may attempt to block indicators or events typically captured by sensors from being gathered and analyzed. This could include modifying sensor settings stored in configuration files and/or Registry keys to disable or maliciously redirect event telemetry. "
                },
                {
                    "ID": "T1066",
                    "Name": "Indicator Removal from Tools",
                    "Description": "If a malicious tool is detected and quarantined or otherwise curtailed, an adversary may be able to determine why the malicious tool was detected (the indicator), modify the tool by removing the indicator, and use the updated version that is no longer detected by the target's defensive systems or subsequent targets that may use similar systems."
                },
                {
                    "ID": "T1070",
                    "Name": "Indicator Removal on Host",
                    "Description": "Adversaries may delete or alter generated artifacts on a host system, including logs and potentially captured files such as quarantined malware. Locations and format of logs will vary, but typical organic system logs are captured as Windows events or Linux/macOS files such as Bash History and /var/log/* ."
                },
                {
                    "ID": "T1202",
                    "Name": "Indirect Command Execution",
                    "Description": "Various Windows utilities may be used to execute commands, possibly without invoking cmd. For example, Forfiles, the Program Compatibility Assistant (pcalua.exe), components of the Windows Subsystem for Linux (WSL), as well as other utilities may invoke the execution of programs and commands from a Command-Line Interface, Run window, or via scripts.  "
                },
                {
                    "ID": "T1130",
                    "Name": "Install Root Certificate",
                    "Description": "Root certificates are used in public key cryptography to identify a root certificate authority (CA). When a root certificate is installed, the system or application will trust certificates in the root's chain of trust that have been signed by the root certificate.  Certificates are commonly used for establishing secure TLS/SSL communications within a web browser. When a user attempts to browse a website that presents a certificate that is not trusted an error message will be displayed to warn the user of the security risk. Depending on the security settings, the browser may not allow the user to establish a connection to the website."
                },
                {
                    "ID": "T1118",
                    "Name": "InstallUtil",
                    "Description": "InstallUtil is a command-line utility that allows for installation and uninstallation of resources by executing specific installer components specified in .NET binaries.  InstallUtil is located in the .NET directories on a Windows system: C:\\Windows\\Microsoft.NET\\Framework\\v\\InstallUtil.exe and C:\\Windows\\Microsoft.NET\\Framework64\\v\\InstallUtil.exe. InstallUtil.exe is digitally signed by Microsoft."
                },
                {
                    "ID": "T1152",
                    "Name": "Launchctl",
                    "Description": "Launchctl controls the macOS launchd process which handles things like launch agents and launch daemons, but can execute other commands or programs itself. Launchctl supports taking subcommands on the command-line, interactively, or even redirected from standard input. By loading or reloading launch agents or launch daemons, adversaries can install persistence or execute changes they made  . Running a command from launchctl is as simple as launchctl submit -l  -- /Path/to/thing/to/execute \"arg\" \"arg\" \"arg\". Loading, unloading, or reloading launch agents or launch daemons can require elevated privileges. "
                },
                {
                    "ID": "T1149",
                    "Name": "LC_MAIN Hijacking",
                    "Description": "As of OS X 10.8, mach-O binaries introduced a new header called LC_MAIN that points to the binary’s entry point for execution. Previously, there were two headers to achieve this same effect: LC_THREAD and LC_UNIXTHREAD  . The entry point for a binary can be hijacked so that initial execution flows to a malicious addition (either another section or a code cave) and then goes back to the initial entry point so that the victim doesn’t know anything was different  . By modifying a binary in this way, application whitelisting can be bypassed because the file name or application path is still the same."
                },
                {
                    "ID": "T1036",
                    "Name": "Masquerading",
                    "Description": "Masquerading occurs when the name or location of an executable, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. Several different variations of this technique have been observed."
                },
                {
                    "ID": "T1112",
                    "Name": "Modify Registry",
                    "Description": "Adversaries may interact with the Windows Registry to hide configuration information within Registry keys, remove information as part of cleaning up, or as part of other techniques to aid in Persistence and Execution."
                },
                {
                    "ID": "T1170",
                    "Name": "Mshta",
                    "Description": "Mshta.exe is a utility that executes Microsoft HTML Applications (HTA). HTA files have the file extension .hta.  HTAs are standalone applications that execute using the same models and technologies of Internet Explorer, but outside of the browser. "
                },
                {
                    "ID": "T1126",
                    "Name": "Network Share Connection Removal",
                    "Description": "Windows shared drive and Windows Admin Shares connections can be removed when no longer needed. Net is an example utility that can be used to remove network share connections with the net use \\system\\share /delete command. "
                },
                {
                    "ID": "T1096",
                    "Name": "NTFS File Attributes",
                    "Description": "Every New Technology File System (NTFS) formatted partition contains a Master File Table (MFT) that maintains a record for every file/directory on the partition.  Within MFT entries are file attributes,  such as Extended Attributes (EA) and Data [known as Alternate Data Streams (ADSs) when more than one Data attribute is present], that can be used to store arbitrary data (and even complete files).    "
                },
                {
                    "ID": "T1027",
                    "Name": "Obfuscated Files or Information",
                    "Description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses."
                },
                {
                    "ID": "T1150",
                    "Name": "Plist Modification",
                    "Description": "Property list (plist) files contain all of the information that macOS and OS X uses to configure applications and services. These files are UTF-8 encoded and formatted like XML documents via a series of keys surrounded by < >. They detail when programs should execute, file paths to the executables, program arguments, required OS permissions, and many others. plists are located in certain locations depending on their purpose such as /Library/Preferences (which execute with elevated privileges) and ~/Library/Preferences (which execute with a user's privileges). "
                },
                {
                    "ID": "T1205",
                    "Name": "Port Knocking",
                    "Description": "Port Knocking is a well-established method used by both defenders and adversaries to hide open ports from access. To enable a port, an adversary sends a series of packets with certain characteristics before the port will be opened. Usually this series of packets consists of attempted connections to a predefined sequence of closed ports, but can involve unusual flags, specific strings or other unique characteristics. After the sequence is completed, opening a port is often accomplished by the host based firewall, but could also be implemented by custom software. "
                },
                {
                    "ID": "T1186",
                    "Name": "Process Doppelgänging",
                    "Description": "Windows Transactional NTFS (TxF) was introduced in Vista as a method to perform safe file operations.  To ensure data integrity, TxF enables only one transacted handle to write to a file at a given time. Until the write handle transaction is terminated, all other handles are isolated from the writer and may only read the committed version of the file that existed at the time the handle was opened.  To avoid corruption, TxF performs an automatic rollback if the system or application fails during a write transaction. "
                },
                {
                    "ID": "T1093",
                    "Name": "Process Hollowing",
                    "Description": "Process hollowing occurs when a process is created in a suspended state then its memory is unmapped and replaced with malicious code. Similar to Process Injection, execution of the malicious code is masked under a legitimate process and may evade defenses and detection analysis.  "
                },
                {
                    "ID": "T1055",
                    "Name": "Process Injection",
                    "Description": "Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process."
                },
                {
                    "ID": "T1108",
                    "Name": "Redundant Access",
                    "Description": "Adversaries may use more than one remote access tool with varying command and control protocols as a hedge against detection. If one type of tool is detected and blocked or removed as a response but the organization did not gain a full understanding of the adversary's tools and access, then the adversary will be able to retain access to the network. Adversaries may also attempt to gain access to Valid Accounts to use External Remote Services such as external VPNs as a way to maintain access despite interruptions to remote access tools deployed within a target network. "
                },
                {
                    "ID": "T1121",
                    "Name": "Regsvcs/Regasm",
                    "Description": "Regsvcs and Regasm are Windows command-line utilities that are used to register .NET Component Object Model (COM) assemblies. Both are digitally signed by Microsoft.  "
                },
                {
                    "ID": "T1117",
                    "Name": "Regsvr32",
                    "Description": "Regsvr32.exe is a command-line program used to register and unregister object linking and embedding controls, including dynamic link libraries (DLLs), on Windows systems. Regsvr32.exe can be used to execute arbitrary binaries. "
                },
                {
                    "ID": "T1014",
                    "Name": "Rootkit",
                    "Description": "Rootkits are programs that hide the existence of malware by intercepting (i.e., Hooking) and modifying operating system API calls that supply system information.  Rootkits or rootkit enabling functionality may reside at the user or kernel level in the operating system or lower, to include a Hypervisor, Master Boot Record, or the System Firmware. "
                },
                {
                    "ID": "T1085",
                    "Name": "Rundll32",
                    "Description": "The rundll32.exe program can be called to execute an arbitrary binary. Adversaries may take advantage of this functionality to proxy execution of code to avoid triggering security tools that may not monitor execution of the rundll32.exe process because of whitelists or false positives from Windows using rundll32.exe for normal operations."
                },
                {
                    "ID": "T1064",
                    "Name": "Scripting",
                    "Description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and PowerShell but could also be in the form of command-line batch scripts."
                },
                {
                    "ID": "T1218",
                    "Name": "Signed Binary Proxy Execution",
                    "Description": "Binaries signed with trusted digital certificates can execute on Windows systems protected by digital signature validation. Several Microsoft signed binaries that are default on Windows installations can be used to proxy execution of other files. This behavior may be abused by adversaries to execute malicious files that could bypass application whitelisting and signature validation on systems. This technique accounts for proxy execution methods that are not already accounted for within the existing techniques."
                },
                {
                    "ID": "T1216",
                    "Name": "Signed Script Proxy Execution",
                    "Description": "Scripts signed with trusted certificates can be used to proxy execution of malicious files. This behavior may bypass signature validation restrictions and application whitelisting solutions that do not account for use of these scripts."
                },
                {
                    "ID": "T1198",
                    "Name": "SIP and Trust Provider Hijacking",
                    "Description": "In user mode, Windows Authenticode  digital signatures are used to verify a file's origin and integrity, variables that may be used to establish trust in signed code (ex: a driver with a valid Microsoft signature may be handled as safe). The signature validation process is handled via the WinVerifyTrust application programming interface (API) function,   which accepts an inquiry and coordinates with the appropriate trust provider, which is responsible for validating parameters of a signature. "
                },
                {
                    "ID": "T1045",
                    "Name": "Software Packing",
                    "Description": "Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory."
                },
                {
                    "ID": "T1151",
                    "Name": "Space after Filename",
                    "Description": "Adversaries can hide a program's true filetype by changing the extension of a file. With certain file types (specifically this does not work with .app extensions), appending a space to the end of a filename will change how the file is processed by the operating system. For example, if there is a Mach-O executable file called evil.bin, when it is double clicked by a user, it will launch Terminal.app and execute. If this file is renamed to evil.txt, then when double clicked by a user, it will launch with the default text editing application (not executing the binary). However, if the file is renamed to \"evil.txt \" (note the space at the end), then when double clicked by a user, the true file type is determined by the OS and handled appropriately and the binary will be executed . "
                },
                {
                    "ID": "T1221",
                    "Name": "Template Injection",
                    "Description": "Microsoft’s Open Office XML (OOXML) specification defines an XML-based format for Office documents (.docx, xlsx, .pptx) to replace older binary formats (.doc, .xls, .ppt). OOXML files are packed together ZIP archives compromised of various XML files, referred to as parts, containing properties that collectively define how a document is rendered. "
                },
                {
                    "ID": "T1099",
                    "Name": "Timestomp",
                    "Description": "Timestomping is a technique that modifies the timestamps of a file (the modify, access, create, and change times), often to mimic files that are in the same folder. This is done, for example, on files that have been modified or created by the adversary so that they do not appear conspicuous to forensic investigators or file analysis tools. Timestomping may be used along with file name Masquerading to hide malware and tools. "
                },
                {
                    "ID": "T1127",
                    "Name": "Trusted Developer Utilities",
                    "Description": "There are many utilities used for software development related tasks that can be used to execute code in various forms to assist in development, debugging, and reverse engineering. These utilities may often be signed with legitimate certificates that allow them to execute on a system and proxy execution of malicious code through a trusted process that effectively bypasses application whitelisting defensive solutions."
                },
                {
                    "ID": "T1078",
                    "Name": "Valid Accounts",
                    "Description": "Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. "
                },
                {
                    "ID": "T1102",
                    "Name": "Web Service",
                    "Description": "Adversaries may use an existing, legitimate external Web service as a means for relaying commands to a compromised system."
                },
                {
                    "ID": "T1220",
                    "Name": "XSL Script Processing",
                    "Description": "Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. To support complex operations, the XSL standard includes support for embedded scripting in various languages. "
                }
            ]
        },
        "Credential Access": {
            "Name": "Credential Access",
            "Description": "Credential access represents techniques resulting in access to or control over system, domain, or service credentials that are used within an enterprise environment. Adversaries will likely attempt to obtain legitimate credentials from users or administrator accounts (local system administrator or domain users with administrator access) to use within the network. This allows the adversary to assume the identity of the account, with all of that account's permissions on the system and network, and makes it harder for defenders to detect the adversary. With sufficient access within a network, an adversary can create accounts for later use within the environment.\n                ",
            "ID": "TA0006",
            "Techniques": [
                {
                    "ID": "T1098",
                    "Name": "Account Manipulation",
                    "Description": "Account manipulation may aid adversaries in maintaining access to credentials and certain permission levels within an environment. Manipulation could consist of modifying permissions, modifying credentials, adding or changing permission groups, modifying account settings, or modifying how authentication is performed. These actions could also include account activity designed to subvert security policies, such as performing iterative password updates to subvert password duration policies and preserve the life of compromised credentials. In order to create or manipulate accounts, the adversary must already have sufficient permissions on systems or the domain."
                },
                {
                    "ID": "T1139",
                    "Name": "Bash History",
                    "Description": "Bash keeps track of the commands users type on the command-line with the \"history\" utility. Once a user logs out, the history is flushed to the user’s .bash_history file. For each user, this file resides at the same location: ~/.bash_history. Typically, this file keeps track of the user’s last 500 commands. Users often type usernames and passwords on the command-line as parameters to programs, which then get saved to this file when they log out. Attackers can abuse this by looking through the file for potential credentials. "
                },
                {
                    "ID": "T1110",
                    "Name": "Brute Force",
                    "Description": "Adversaries may use brute force techniques to attempt access to accounts when passwords are unknown or when password hashes are obtained."
                },
                {
                    "ID": "T1003",
                    "Name": "Credential Dumping",
                    "Description": "Credential dumping is the process of obtaining account login and password information, normally in the form of a hash or a clear text password, from the operating system and software. Credentials can then be used to perform Lateral Movement and access restricted information."
                },
                {
                    "ID": "T1081",
                    "Name": "Credentials in Files",
                    "Description": "Adversaries may search local file systems and remote file shares for files containing passwords. These can be files created by users to store their own credentials, shared credential stores for a group of individuals, configuration files containing passwords for a system or service, or source code/binary files containing embedded passwords."
                },
                {
                    "ID": "T1214",
                    "Name": "Credentials in Registry",
                    "Description": "The Windows Registry stores configuration information that can be used by the system or other programs. Adversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services. Sometimes these credentials are used for automatic logons."
                },
                {
                    "ID": "T1212",
                    "Name": "Exploitation for Credential Access",
                    "Description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Credentialing and authentication mechanisms may be targeted for exploitation by adversaries as a means to gain access to useful credentials or circumvent the process to gain access to systems. One example of this is MS14-068, which targets Kerberos and can be used to forge Kerberos tickets using domain user permissions.   Exploitation for credential access may also result in Privilege Escalation depending on the process targeted or credentials obtained."
                },
                {
                    "ID": "T1187",
                    "Name": "Forced Authentication",
                    "Description": "The Server Message Block (SMB) protocol is commonly used in Windows networks for authentication and communication between systems for access to resources and file sharing. When a Windows system attempts to connect to an SMB resource it will automatically attempt to authenticate and send credential information for the current user to the remote system.  This behavior is typical in enterprise environments so that users do not need to enter credentials to access network resources. Web Distributed Authoring and Versioning (WebDAV) is typically used by Windows systems as a backup protocol when SMB is blocked or fails. WebDAV is an extension of HTTP and will typically operate over TCP ports 80 and 443.  "
                },
                {
                    "ID": "T1179",
                    "Name": "Hooking",
                    "Description": "Windows processes often leverage application programming interface (API) functions to perform tasks that require reusable system resources. Windows API functions are typically stored in dynamic-link libraries (DLLs) as exported functions. Hooking involves redirecting calls to these functions and can be implemented via:"
                },
                {
                    "ID": "T1056",
                    "Name": "Input Capture",
                    "Description": "Adversaries can use methods of capturing user input for obtaining credentials for Valid Accounts and information Collection that include keylogging and user input field interception."
                },
                {
                    "ID": "T1141",
                    "Name": "Input Prompt",
                    "Description": "When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task. Adversaries can mimic this functionality to prompt users for credentials with a normal-looking prompt. This type of prompt can be accomplished with AppleScript:"
                },
                {
                    "ID": "T1208",
                    "Name": "Kerberoasting",
                    "Description": "Service principal names (SPNs) are used to uniquely identify each instance of a Windows service. To enable authentication, Kerberos requires that SPNs be associated with at least one service logon account (an account specifically tasked with running a service ).    "
                },
                {
                    "ID": "T1142",
                    "Name": "Keychain",
                    "Description": "Keychains are the built-in way for macOS to keep track of users' passwords and credentials for many services and features such as WiFi passwords, websites, secure notes, certificates, and Kerberos. Keychain files are located in ~/Library/Keychains/,/Library/Keychains/, and /Network/Library/Keychains/.  The security command-line utility, which is built into macOS by default, provides a useful way to manage these credentials."
                },
                {
                    "ID": "T1171",
                    "Name": "LLMNR/NBT-NS Poisoning",
                    "Description": "Link-Local Multicast Name Resolution (LLMNR) and NetBIOS Name Service (NBT-NS) are Microsoft Windows components that serve as alternate methods of host identification. LLMNR is based upon the Domain Name System (DNS) format and allows hosts on the same local link to perform name resolution for other hosts. NBT-NS identifies systems on a local network by their NetBIOS name.  "
                },
                {
                    "ID": "T1040",
                    "Name": "Network Sniffing",
                    "Description": "Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection. An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data."
                },
                {
                    "ID": "T1174",
                    "Name": "Password Filter DLL",
                    "Description": "Windows password filters are password policy enforcement mechanisms for both domain and local accounts. Filters are implemented as dynamic link libraries (DLLs) containing a method to validate potential passwords against password policies. Filter DLLs can be positioned on local computers for local accounts and/or domain controllers for domain accounts."
                },
                {
                    "ID": "T1145",
                    "Name": "Private Keys",
                    "Description": "Private cryptographic keys and certificates are used for authentication, encryption/decryption, and digital signatures. "
                },
                {
                    "ID": "T1167",
                    "Name": "Securityd Memory",
                    "Description": "In OS X prior to El Capitan, users with root access can read plaintext keychain passwords of logged-in users because Apple’s keychain implementation allows these credentials to be cached so that users are not repeatedly prompted for passwords.   Apple’s securityd utility takes the user’s logon password, encrypts it with PBKDF2, and stores this master key in memory. Apple also uses a set of keys and algorithms to encrypt the user’s password, but once the master key is found, an attacker need only iterate over the other values to unlock the final password. "
                },
                {
                    "ID": "T1111",
                    "Name": "Two-Factor Authentication Interception",
                    "Description": "Use of two- or multifactor authentication is recommended and provides a higher level of security than user names and passwords alone, but organizations should be aware of techniques that could be used to intercept and bypass these security mechanisms. Adversaries may target authentication mechanisms, such as smart cards, to gain access to systems, services, and network resources."
                }
            ]
        },
        "Discovery": {
            "Name": "Discovery",
            "Description": "Discovery consists of techniques that allow the adversary to gain knowledge about the system and internal network. When adversaries gain access to a new system, they must orient themselves to what they now have control of and what benefits operating from that system give to their current objective or overall goals during the intrusion. The operating system provides many native tools that aid in this post-compromise information-gathering phase.\n                ",
            "ID": "TA0007",
            "Techniques": [
                {
                    "ID": "T1087",
                    "Name": "Account Discovery",
                    "Description": "Adversaries may attempt to get a listing of local system or domain accounts. "
                },
                {
                    "ID": "T1010",
                    "Name": "Application Window Discovery",
                    "Description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used or give context to information collected by a keylogger."
                },
                {
                    "ID": "T1217",
                    "Name": "Browser Bookmark Discovery",
                    "Description": "Adversaries may enumerate browser bookmarks to learn more about compromised hosts. Browser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about internal network resources such as servers, tools/dashboards, or other related infrastructure."
                },
                {
                    "ID": "T1083",
                    "Name": "File and Directory Discovery",
                    "Description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. "
                },
                {
                    "ID": "T1046",
                    "Name": "Network Service Scanning",
                    "Description": "Adversaries may attempt to get a listing of services running on remote hosts, including those that may be vulnerable to remote software exploitation. Methods to acquire this information include port scans and vulnerability scans using tools that are brought onto a system."
                },
                {
                    "ID": "T1135",
                    "Name": "Network Share Discovery",
                    "Description": "Networks often contain shared network drives and folders that enable users to access file directories on various systems across a network. "
                },
                {
                    "ID": "T1040",
                    "Name": "Network Sniffing",
                    "Description": "Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection. An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data."
                },
                {
                    "ID": "T1201",
                    "Name": "Password Policy Discovery",
                    "Description": "Password policies for networks are a way to enforce complex passwords that are difficult to guess or crack through Brute Force. An adversary may attempt to access detailed information about the password policy used within an enterprise network. This would help the adversary to create a list of common passwords and launch dictionary and/or brute force attacks which adheres to the policy (e.g. if the minimum password length should be 8, then not trying passwords such as 'pass123'; not checking for more than 3-4 passwords per account if the lockout is set to 6 as to not lock out accounts)."
                },
                {
                    "ID": "T1120",
                    "Name": "Peripheral Device Discovery",
                    "Description": "Adversaries may attempt to gather information about attached peripheral devices and components connected to a computer system. The information may be used to enhance their awareness of the system and network environment or may be used for further actions."
                },
                {
                    "ID": "T1069",
                    "Name": "Permission Groups Discovery",
                    "Description": "Adversaries may attempt to find local system or domain-level groups and permissions settings. "
                },
                {
                    "ID": "T1057",
                    "Name": "Process Discovery",
                    "Description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software running on systems within the network."
                },
                {
                    "ID": "T1012",
                    "Name": "Query Registry",
                    "Description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software."
                },
                {
                    "ID": "T1018",
                    "Name": "Remote System Discovery",
                    "Description": "Adversaries will likely attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for Lateral Movement from the current system. Functionality could exist within remote access tools to enable this, but utilities available on the operating system could also be used. "
                },
                {
                    "ID": "T1063",
                    "Name": "Security Software Discovery",
                    "Description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on the system. This may include things such as local firewall rules, anti-virus, and virtualization. These checks may be built into early-stage remote access tools."
                },
                {
                    "ID": "T1082",
                    "Name": "System Information Discovery",
                    "Description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture."
                },
                {
                    "ID": "T1016",
                    "Name": "System Network Configuration Discovery",
                    "Description": "Adversaries will likely look for details about the network configuration and settings of systems they access or through information discovery of remote systems. Several operating system administration utilities exist that can be used to gather this information. Examples include Arp, ipconfig/ifconfig, nbtstat, and route."
                },
                {
                    "ID": "T1049",
                    "Name": "System Network Connections Discovery",
                    "Description": "Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network. "
                },
                {
                    "ID": "T1033",
                    "Name": "System Owner/User Discovery",
                    "Description": "Adversaries may attempt to identify the primary user, currently logged in user, set of users that commonly uses a system, or whether a user is actively using the system. They may do this, for example, by retrieving account usernames or by using Credential Dumping. The information may be collected in a number of different ways using other Discovery techniques, because user and username details are prevalent throughout a system and include running process ownership, file/directory ownership, session information, and system logs."
                },
                {
                    "ID": "T1007",
                    "Name": "System Service Discovery",
                    "Description": "Adversaries may try to get information about registered services. Commands that may obtain information about services using operating system utilities are \"sc,\" \"tasklist /svc\" using Tasklist, and \"net start\" using Net, but adversaries may also use other tools as well."
                },
                {
                    "ID": "T1124",
                    "Name": "System Time Discovery",
                    "Description": "The system time is set and stored by the Windows Time Service within a domain to maintain time synchronization between systems and services in an enterprise network.  "
                }
            ]
        },
        "Lateral Movement": {
            "Name": "Lateral Movement",
            "Description": "Lateral movement consists of techniques that enable an adversary to access and control remote systems on a network and could, but does not necessarily, include execution of tools on remote systems. The lateral movement techniques could allow an adversary to gather information from a system without needing additional tools, such as a remote access tool.\n                ",
            "ID": "TA0008",
            "Techniques": [
                {
                    "ID": "T1155",
                    "Name": "AppleScript",
                    "Description": "macOS and OS X applications send AppleEvent messages to each other for interprocess communications (IPC). These messages can be easily scripted with AppleScript for local or remote IPC. Osascript executes AppleScript and any other Open Scripting Architecture (OSA) language scripts. A list of OSA languages installed on a system can be found by using the osalang program."
                },
                {
                    "ID": "T1017",
                    "Name": "Application Deployment Software",
                    "Description": "Adversaries may deploy malicious software to systems within a network using application deployment systems employed by enterprise administrators. The permissions required for this action vary by system configuration; local credentials may be sufficient with direct access to the deployment server, or specific domain credentials may be required. However, the system may require an administrative account to log in or to perform software deployment."
                },
                {
                    "ID": "T1175",
                    "Name": "Distributed Component Object Model",
                    "Description": "Windows Distributed Component Object Model (DCOM) is transparent middleware that extends the functionality of Component Object Model (COM)  beyond a local computer using remote procedure call (RPC) technology. COM is a component of the Windows application programming interface (API) that enables interaction between software objects. Through COM, a client object can call methods of server objects, which are typically Dynamic Link Libraries (DLL) or executables (EXE)."
                },
                {
                    "ID": "T1210",
                    "Name": "Exploitation of Remote Services",
                    "Description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. A common goal for post-compromise exploitation of remote services is for lateral movement to enable access to a remote system."
                },
                {
                    "ID": "T1037",
                    "Name": "Logon Scripts",
                    "Description": "Windows allows logon scripts to be run whenever a specific user or group of users log into a system.  The scripts can be used to perform administrative functions, which may often execute other programs or send information to an internal logging server."
                },
                {
                    "ID": "T1075",
                    "Name": "Pass the Hash",
                    "Description": "Pass the hash (PtH) is a method of authenticating as a user without having access to the user's cleartext password. This method bypasses standard authentication steps that require a cleartext password, moving directly into the portion of the authentication that uses the password hash. In this technique, valid password hashes for the account being used are captured using a Credential Access technique. Captured hashes are used with PtH to authenticate as that user. Once authenticated, PtH may be used to perform actions on local or remote systems. "
                },
                {
                    "ID": "T1097",
                    "Name": "Pass the Ticket",
                    "Description": "Pass the ticket (PtT) is a method of authenticating to a system using Kerberos tickets without having access to an account's password. Kerberos authentication can be used as the first step to lateral movement to a remote system."
                },
                {
                    "ID": "T1076",
                    "Name": "Remote Desktop Protocol",
                    "Description": "Remote desktop is a common feature in operating systems. It allows a user to log into an interactive session with a system desktop graphical user interface on a remote system. Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote Desktop Services (RDS).  There are other implementations and third-party tools that provide graphical access Remote Services similar to RDS."
                },
                {
                    "ID": "T1105",
                    "Name": "Remote File Copy",
                    "Description": "Files may be copied from one system to another to stage adversary tools or other files over the course of an operation. Files may be copied from an external adversary-controlled system through the Command and Control channel to bring tools into the victim network or through alternate protocols with another tool such as FTP. Files can also be copied over on Mac and Linux with native tools like scp, rsync, and sftp."
                },
                {
                    "ID": "T1021",
                    "Name": "Remote Services",
                    "Description": "An adversary may use Valid Accounts to log into a service specifically designed to accept remote connections, such as telnet, SSH, and VNC. The adversary may then perform actions as the logged-on user."
                },
                {
                    "ID": "T1091",
                    "Name": "Replication Through Removable Media",
                    "Description": "Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes. In the case of Lateral Movement, this may occur through modification of executable files stored on removable media or by copying malware and renaming it to look like a legitimate file to trick users into executing it on a separate system. In the case of Initial Access, this may occur through manual manipulation of the media, modification of systems used to initially format the media, or modification to the media's firmware itself."
                },
                {
                    "ID": "T1051",
                    "Name": "Shared Webroot",
                    "Description": "Adversaries may add malicious content to an internally accessible website through an open network file share that contains the website's webroot or Web content directory   and then browse to that content with a Web browser to cause the server to execute the malicious content. The malicious content will typically run under the context and permissions of the Web server process, often resulting in local system or administrative privileges, depending on how the Web server is configured."
                },
                {
                    "ID": "T1184",
                    "Name": "SSH Hijacking",
                    "Description": "Secure Shell (SSH) is a standard means of remote access on Linux and macOS systems. It allows a user to connect to another system via an encrypted tunnel, commonly authenticating through a password, certificate or the use of an asymmetric encryption key pair."
                },
                {
                    "ID": "T1080",
                    "Name": "Taint Shared Content",
                    "Description": "Content stored on network drives or in other shared locations may be tainted by adding malicious programs, scripts, or exploit code to otherwise valid files. Once a user opens the shared tainted content, the malicious portion can be executed to run the adversary's code on a remote system. Adversaries may use tainted shared content to move laterally."
                },
                {
                    "ID": "T1072",
                    "Name": "Third-party Software",
                    "Description": "Third-party applications and software deployment systems may be in use in the network environment for administration purposes (e.g., SCCM, VNC, HBSS, Altiris, etc.). If an adversary gains access to these systems, then they may be able to execute code."
                },
                {
                    "ID": "T1077",
                    "Name": "Windows Admin Shares",
                    "Description": "Windows systems have hidden network shares that are accessible only to administrators and provide the ability for remote file copy and other administrative functions. Example network shares include C$, ADMIN$, and IPC$. "
                },
                {
                    "ID": "T1028",
                    "Name": "Windows Remote Management",
                    "Description": "Windows Remote Management (WinRM) is the name of both a Windows service and a protocol that allows a user to interact with a remote system (e.g., run an executable, modify the Registry, modify services).  It may be called with the winrm command or by any number of programs such as PowerShell. "
                }
            ]
        },
        "Collection": {
            "Name": "Collection",
            "Description": "Collection consists of techniques used to identify and gather information, such as sensitive files, from a target network prior to exfiltration. This category also covers locations on a system or network where the adversary may look for information to exfiltrate.\n                ",
            "ID": "TA0009",
            "Techniques": [
                {
                    "ID": "T1123",
                    "Name": "Audio Capture",
                    "Description": "An adversary can leverage a computer's peripheral devices (e.g., microphones and webcams) or applications (e.g., voice and video call services) to capture audio recordings for the purpose of listening into sensitive conversations to gather information."
                },
                {
                    "ID": "T1119",
                    "Name": "Automated Collection",
                    "Description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of Scripting to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. This functionality could also be built into remote access tools. "
                },
                {
                    "ID": "T1115",
                    "Name": "Clipboard Data",
                    "Description": "Adversaries may collect data stored in the Windows clipboard from users copying information within or between applications. "
                },
                {
                    "ID": "T1213",
                    "Name": "Data from Information Repositories",
                    "Description": "Adversaries may leverage information repositories to mine valuable information. Information repositories are tools that allow for storage of information, typically to facilitate collaboration or information sharing between users, and can store a wide variety of data that may aid adversaries in further objectives, or direct access to the target information."
                },
                {
                    "ID": "T1005",
                    "Name": "Data from Local System",
                    "Description": "Sensitive data can be collected from local system sources, such as the file system or databases of information residing on the system prior to Exfiltration."
                },
                {
                    "ID": "T1039",
                    "Name": "Data from Network Shared Drive",
                    "Description": "Sensitive data can be collected from remote systems via shared network drives (host shared directory, network file server, etc.) that are accessible from the current system prior to Exfiltration."
                },
                {
                    "ID": "T1025",
                    "Name": "Data from Removable Media",
                    "Description": "Sensitive data can be collected from any removable media (optical disk drive, USB memory, etc.) connected to the compromised system prior to Exfiltration."
                },
                {
                    "ID": "T1074",
                    "Name": "Data Staged",
                    "Description": "Collected data is staged in a central location or directory prior to Exfiltration. Data may be kept in separate files or combined into one file through techniques such as Data Compressed or Data Encrypted."
                },
                {
                    "ID": "T1114",
                    "Name": "Email Collection",
                    "Description": "Adversaries may target user email to collect sensitive information from a target."
                },
                {
                    "ID": "T1056",
                    "Name": "Input Capture",
                    "Description": "Adversaries can use methods of capturing user input for obtaining credentials for Valid Accounts and information Collection that include keylogging and user input field interception."
                },
                {
                    "ID": "T1185",
                    "Name": "Man in the Browser",
                    "Description": "Adversaries can take advantage of security vulnerabilities and inherent functionality in browser software to change content, modify behavior, and intercept information as part of various man in the browser techniques. "
                },
                {
                    "ID": "T1113",
                    "Name": "Screen Capture",
                    "Description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations."
                },
                {
                    "ID": "T1125",
                    "Name": "Video Capture",
                    "Description": "An adversary can leverage a computer's peripheral devices (e.g., integrated cameras or webcams) or applications (e.g., video call services) to capture video recordings for the purpose of gathering information. Images may also be captured from devices or applications, potentially in specified intervals, in lieu of video files."
                }
            ]
        },
        "Exfiltration": {
            "Name": "Exfiltration",
            "Description": "Exfiltration refers to techniques and attributes that result or aid in the adversary removing files and information from a target network. This category also covers locations on a system or network where the adversary may look for information to exfiltrate.\n                ",
            "ID": "TA0010",
            "Techniques": [
                {
                    "ID": "T1020",
                    "Name": "Automated Exfiltration",
                    "Description": "Data, such as sensitive documents, may be exfiltrated through the use of automated processing or Scripting after being gathered during Collection. "
                },
                {
                    "ID": "T1002",
                    "Name": "Data Compressed",
                    "Description": "An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network. The compression is done separately from the exfiltration channel and is performed using a custom program or algorithm, or a more common compression library or utility such as 7zip, RAR, ZIP, or zlib."
                },
                {
                    "ID": "T1022",
                    "Name": "Data Encrypted",
                    "Description": "Data is encrypted before being exfiltrated in order to hide the information that is being exfiltrated from detection or to make the exfiltration less conspicuous upon inspection by a defender. The encryption is performed by a utility, programming library, or custom algorithm on the data itself and is considered separate from any encryption performed by the command and control or file transfer protocol. Common file archive formats that can encrypt files are RAR and zip."
                },
                {
                    "ID": "T1030",
                    "Name": "Data Transfer Size Limits",
                    "Description": "An adversary may exfiltrate data in fixed size chunks instead of whole files or limit packet sizes below certain thresholds. This approach may be used to avoid triggering network data transfer threshold alerts."
                },
                {
                    "ID": "T1048",
                    "Name": "Exfiltration Over Alternative Protocol",
                    "Description": "Data exfiltration is performed with a different protocol from the main command and control protocol or channel. The data is likely to be sent to an alternate network location from the main command and control server. Alternate protocols include FTP, SMTP, HTTP/S, DNS, or some other network protocol. Different channels could include Internet Web services such as cloud storage."
                },
                {
                    "ID": "T1041",
                    "Name": "Exfiltration Over Command and Control Channel",
                    "Description": "Data exfiltration is performed over the Command and Control channel. Data is encoded into the normal communications channel using the same protocol as command and control communications."
                },
                {
                    "ID": "T1011",
                    "Name": "Exfiltration Over Other Network Medium",
                    "Description": "Exfiltration could occur over a different network medium than the command and control channel. If the command and control network is a wired Internet connection, the exfiltration may occur, for example, over a WiFi connection, modem, cellular data connection, Bluetooth, or another radio frequency (RF) channel. Adversaries could choose to do this if they have sufficient access or proximity, and the connection might not be secured or defended as well as the primary Internet-connected channel because it is not routed through the same enterprise network."
                },
                {
                    "ID": "T1052",
                    "Name": "Exfiltration Over Physical Medium",
                    "Description": "In certain circumstances, such as an air-gapped network compromise, exfiltration could occur via a physical medium or device introduced by a user. Such media could be an external hard drive, USB drive, cellular phone, MP3 player, or other removable storage and processing device. The physical medium or device could be used as the final exfiltration point or to hop between otherwise disconnected systems."
                },
                {
                    "ID": "T1029",
                    "Name": "Scheduled Transfer",
                    "Description": "Data exfiltration may be performed only at certain times of day or at certain intervals. This could be done to blend traffic patterns with normal activity or availability."
                }
            ]
        },
        "Command and Control": {
            "Name": "Command and Control",
            "Description": "The command and control tactic represents how adversaries communicate with systems under their control within a target network. There are many ways an adversary can establish command and control with various levels of covertness, depending on system configuration and network topology. Due to the wide degree of variation available to the adversary at the network level, only the most common factors were used to describe the differences in command and control. There are still a great many specific techniques within the documented methods, largely due to how easy it is to define new protocols and use existing, legitimate protocols and network services for communication. The resulting breakdown should help convey the concept that detecting intrusion through command and control protocols without prior knowledge is a difficult proposition over the long term. Adversaries' main constraints in network-level defense avoidance are testing and deployment of tools to rapidly change their protocols, awareness of existing defensive technologies, and access to legitimate Web services that, when used appropriately, make their tools difficult to distinguish from benign traffic.\n                ",
            "ID": "TA0011",
            "Techniques": [
                {
                    "ID": "T1043",
                    "Name": "Commonly Used Port",
                    "Description": "Adversaries may communicate over a commonly used port to bypass firewalls or network detection systems and to blend with normal network activity to avoid more detailed inspection. They may use commonly open ports such as"
                },
                {
                    "ID": "T1092",
                    "Name": "Communication Through Removable Media",
                    "Description": "Adversaries can perform command and control between compromised hosts on potentially disconnected networks using removable media to transfer commands from system to system. Both systems would need to be compromised, with the likelihood that an Internet-connected system was compromised first and the second through lateral movement by Replication Through Removable Media. Commands and files would be relayed from the disconnected system to the Internet-connected system to which the adversary has direct access."
                },
                {
                    "ID": "T1090",
                    "Name": "Connection Proxy",
                    "Description": "A connection proxy is used to direct network traffic between systems or act as an intermediary for network communications. Many tools exist that enable traffic redirection through proxies or port redirection, including HTRAN, ZXProxy, and ZXPortMap. "
                },
                {
                    "ID": "T1094",
                    "Name": "Custom Command and Control Protocol",
                    "Description": "Adversaries may communicate using a custom command and control protocol instead of encapsulating commands/data in an existing Standard Application Layer Protocol. Implementations include mimicking well-known protocols or developing custom protocols (including raw sockets) on top of fundamental protocols provided by TCP/IP/another standard network stack."
                },
                {
                    "ID": "T1024",
                    "Name": "Custom Cryptographic Protocol",
                    "Description": "Adversaries may use a custom cryptographic protocol or algorithm to hide command and control traffic. A simple scheme, such as XOR-ing the plaintext with a fixed key, will produce a very weak ciphertext."
                },
                {
                    "ID": "T1132",
                    "Name": "Data Encoding",
                    "Description": "Command and control (C2) information is encoded using a standard data encoding system. Use of data encoding may be to adhere to existing protocol specifications and includes use of ASCII, Unicode, Base64,  MIME, UTF-8, or other binary-to-text and character encoding systems.   Some data encoding systems may also result in data compression, such as gzip."
                },
                {
                    "ID": "T1001",
                    "Name": "Data Obfuscation",
                    "Description": "Command and control (C2) communications are hidden (but not necessarily encrypted) in an attempt to make the content more difficult to discover or decipher and to make the communication less conspicuous and hide commands from being seen. This encompasses many methods, such as adding junk data to protocol traffic, using steganography, commingling legitimate traffic with C2 communications traffic, or using a non-standard data encoding system, such as a modified Base64 encoding for the message body of an HTTP request."
                },
                {
                    "ID": "T1172",
                    "Name": "Domain Fronting",
                    "Description": "Domain fronting takes advantage of routing schemes in Content Delivery Networks (CDNs) and other services which host multiple domains to obfuscate the intended destination of HTTPS traffic or traffic tunneled through HTTPS.  The technique involves using different domain names in the SNI field of the TLS header and the Host field of the HTTP header. If both domains are served from the same CDN, then the CDN may route to the address specified in the HTTP header after unwrapping the TLS header. A variation of the the technique, \"domainless\" fronting, utilizes a SNI field that is left blank; this may allow the fronting to work even when the CDN attempts to validate that the SNI and HTTP Host fields match (if the blank SNI fields are ignored)."
                },
                {
                    "ID": "T1008",
                    "Name": "Fallback Channels",
                    "Description": "Adversaries may use fallback or alternate communication channels if the primary channel is compromised or inaccessible in order to maintain reliable command and control and to avoid data transfer thresholds."
                },
                {
                    "ID": "T1188",
                    "Name": "Multi-hop Proxy",
                    "Description": "To disguise the source of malicious traffic, adversaries may chain together multiple proxies. Typically, a defender will be able to identify the last proxy traffic traversed before it enters their network; the defender may or may not be able to identify any previous proxies before the last-hop proxy. This technique makes identifying the original source of the malicious traffic even more difficult by requiring the defender to trace malicious traffic through several proxies to identify its source."
                },
                {
                    "ID": "T1104",
                    "Name": "Multi-Stage Channels",
                    "Description": "Adversaries may create multiple stages for command and control that are employed under different conditions or for certain functions. Use of multiple stages may obfuscate the command and control channel to make detection more difficult."
                },
                {
                    "ID": "T1026",
                    "Name": "Multiband Communication",
                    "Description": "Some adversaries may split communications between different protocols. There could be one protocol for inbound command and control and another for outbound data, allowing it to bypass certain firewall restrictions. The split could also be random to simply avoid data threshold alerts on any one communication."
                },
                {
                    "ID": "T1079",
                    "Name": "Multilayer Encryption",
                    "Description": "An adversary performs C2 communications using multiple layers of encryption, typically (but not exclusively) tunneling a custom encryption scheme within a protocol encryption scheme such as HTTPS or SMTPS."
                },
                {
                    "ID": "T1205",
                    "Name": "Port Knocking",
                    "Description": "Port Knocking is a well-established method used by both defenders and adversaries to hide open ports from access. To enable a port, an adversary sends a series of packets with certain characteristics before the port will be opened. Usually this series of packets consists of attempted connections to a predefined sequence of closed ports, but can involve unusual flags, specific strings or other unique characteristics. After the sequence is completed, opening a port is often accomplished by the host based firewall, but could also be implemented by custom software. "
                },
                {
                    "ID": "T1219",
                    "Name": "Remote Access Tools",
                    "Description": "An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks. These services are commonly used as legitimate technical support software, and may be whitelisted within a target environment. Remote access tools like VNC, Ammy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. "
                },
                {
                    "ID": "T1105",
                    "Name": "Remote File Copy",
                    "Description": "Files may be copied from one system to another to stage adversary tools or other files over the course of an operation. Files may be copied from an external adversary-controlled system through the Command and Control channel to bring tools into the victim network or through alternate protocols with another tool such as FTP. Files can also be copied over on Mac and Linux with native tools like scp, rsync, and sftp."
                },
                {
                    "ID": "T1071",
                    "Name": "Standard Application Layer Protocol",
                    "Description": "Adversaries may communicate using a common, standardized application layer protocol such as HTTP, HTTPS, SMTP, or DNS to avoid detection by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server."
                },
                {
                    "ID": "T1032",
                    "Name": "Standard Cryptographic Protocol",
                    "Description": "Adversaries may explicitly employ a known encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol. Despite the use of a secure algorithm, these implementations may be vulnerable to reverse engineering if necessary secret keys are encoded and/or generated within malware samples/configuration files."
                },
                {
                    "ID": "T1095",
                    "Name": "Standard Non-Application Layer Protocol",
                    "Description": "Use of a standard non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive.  Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL)."
                },
                {
                    "ID": "T1065",
                    "Name": "Uncommonly Used Port",
                    "Description": "Adversaries may conduct C2 communications over a non-standard port to bypass proxies and firewalls that have been improperly configured."
                },
                {
                    "ID": "T1102",
                    "Name": "Web Service",
                    "Description": "Adversaries may use an existing, legitimate external Web service as a means for relaying commands to a compromised system."
                }
            ]
        }
    },
    "Mobile": {
        "Initial Access": {
            "Name": "Initial Access",
            "Description": "The initial access tactic represents the vectors adversaries use to gain an initial foothold onto a mobile device.\n                ",
            "ID": "TA0027",
            "Techniques": [
                {
                    "ID": "T1475",
                    "Name": "Deliver Malicious App via Authorized App Store",
                    "Description": "Malicious applications are a common attack vector used by adversaries to gain a presence on mobile devices. Mobile devices often are configured to allow application installation only from an authorized app store (e.g., Google Play Store or Apple App Store). An adversary may seek to place a malicious application in an authorized app store, enabling the application to be installed onto targeted devices."
                },
                {
                    "ID": "T1476",
                    "Name": "Deliver Malicious App via Other Means",
                    "Description": "Malicious applications are a common attack vector used by adversaries to gain a presence on mobile devices. This technique describes installing a malicious application on targeted mobile devices without involving an authorized app store (e.g., Google Play Store or Apple App Store). Adversaries may wish to avoid placing malicious applications in an authorized app store due to increased potential risk of detection or other reasons. However, mobile devices often are configured to allow application installation only from an authorized app store which would prevent this technique from working."
                },
                {
                    "ID": "T1456",
                    "Name": "Drive-by Compromise",
                    "Description": "As described by ATT&CK for Enterprise, a drive-by compromise is when an adversary gains access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is targeted for exploitation. For example, a website may contain malicious media content intended to exploit vulnerabilities in media parsers as demonstrated by the Android Stagefright vulnerability  ."
                },
                {
                    "ID": "T1458",
                    "Name": "Exploit via Charging Station or PC",
                    "Description": "If the mobile device is connected (typically via USB) to a charging station or a PC, for example to charge the device's battery, then a compromised or malicious charging station or PC could attempt to exploit the mobile device via the connection."
                },
                {
                    "ID": "T1477",
                    "Name": "Exploit via Radio Interfaces",
                    "Description": "The mobile device may be targeted for exploitation through its interface to cellular networks or other radio interfaces."
                },
                {
                    "ID": "T1478",
                    "Name": "Install Insecure or Malicious Configuration",
                    "Description": "An adversary could attempt to install insecure or malicious configuration settings on the mobile device, through means such as phishing emails or text messages either directly containing the configuration settings as an attachment, or containing a web link to the configuration settings. The device user may be tricked into installing the configuration settings through social engineering techniques ."
                },
                {
                    "ID": "T1461",
                    "Name": "Lockscreen Bypass",
                    "Description": "An adversary with physical access to a mobile device may seek to bypass the device's lockscreen."
                },
                {
                    "ID": "T1444",
                    "Name": "Repackaged Application",
                    "Description": "An adversary could download a legitimate app, disassemble it, add malicious code, and then reassemble the app, for example as described by Zhou and Jiang in . The app would appear to be the original app but contain additional malicious functionality. The adversary could then publish this app to app stores or use another delivery technique."
                },
                {
                    "ID": "T1474",
                    "Name": "Supply Chain Compromise",
                    "Description": "As further described in ATT&CK for Enterprise, supply chain compromise is the manipulation of products or product delivery mechanisms prior to receipt by a final consumer for the purpose of data or system compromise. Somewhat related, adversaries could also identify and exploit inadvertently present vulnerabilities. In many cases, it may be difficult to be certain whether exploitable functionality is due to malicious intent or simply inadvertent mistake."
                }
            ]
        },
        "Persistence": {
            "Name": "Persistence",
            "Description": "Persistence is any access, action, or configuration change to a mobile device that gives an attacker a persistent presence on the device. Attackers often will need to maintain access to mobile devices through interruptions such as device reboots and potentially even factory data resets.\n                ",
            "ID": "TA0028",
            "Techniques": [
                {
                    "ID": "T1401",
                    "Name": "Abuse Device Administrator Access to Prevent Removal",
                    "Description": "A malicious application can request Device Administrator privileges. If the user grants the privileges, the application can take steps to make its removal more difficult."
                },
                {
                    "ID": "T1402",
                    "Name": "App Auto-Start at Device Boot",
                    "Description": "An Android application can listen for the BOOT_COMPLETED broadcast, ensuring that the app's functionality will be activated every time the device starts up without having to wait for the device user to manually start the app."
                },
                {
                    "ID": "T1403",
                    "Name": "Modify cached executable code",
                    "Description": "ART (the Android Runtime) compiles optimized code on the device itself to improve performance. If an adversary can escalate privileges, he or she may be able to use those privileges to modify the cached code in order to hide malicious behavior. Since the code is compiled on the device, it may not receive the same level of integrity checks that are provided to code running in the system partition."
                },
                {
                    "ID": "T1398",
                    "Name": "Modify OS Kernel or Boot Partition",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device kernel or other boot partition components, where the code may evade detection, may persist after device resets, and may not be removable by the device user. In some cases (e.g., the Samsung Knox warranty bit as described under Detection), the attack may be detected but could result in the device being placed in a state that no longer allows certain functionality."
                },
                {
                    "ID": "T1400",
                    "Name": "Modify System Partition",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device system partition, where it may persist after device resets and may not be easily removed by the device user."
                },
                {
                    "ID": "T1399",
                    "Name": "Modify Trusted Execution Environment",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device's Trusted Execution Environment (TEE) or other similar isolated execution environment where the code can evade detection, may persist after device resets, and may not be removable by the device user. Running code within the TEE may provide an adversary with the ability to monitor or tamper with overall device behavior."
                }
            ]
        },
        "Privilege Escalation": {
            "Name": "Privilege Escalation",
            "Description": "Privilege escalation includes techniques that allow an attacker to obtain a higher level of permissions on the mobile device. Attackers may enter the mobile device with very limited privileges and may be required to take advantage of a device weakness to obtain higher privileges necessary to successfully carry out their mission objectives.\n                ",
            "ID": "TA0029",
            "Techniques": [
                {
                    "ID": "T1404",
                    "Name": "Exploit OS Vulnerability",
                    "Description": "A malicious app can exploit unpatched vulnerabilities in the operating system to obtain escalated privileges."
                },
                {
                    "ID": "T1405",
                    "Name": "Exploit TEE Vulnerability",
                    "Description": "A malicious app or other attack vector could be used to exploit vulnerabilities in code running within the Trusted Execution Environment (TEE) . The adversary could then obtain privileges held by the TEE potentially including the ability to access cryptographic keys or other sensitive data . Escalated operating system privileges may be first required in order to have the ability to attack the TEE . If not, privileges within the TEE can potentially be used to exploit the operating system ."
                }
            ]
        },
        "Defense Evasion": {
            "Name": "Defense Evasion",
            "Description": "Defense evasion consists of techniques an adversary may use to evade detection or avoid other defenses. Sometimes these actions are the same as or variations of techniques in other categories that have the added benefit of subverting a particular defense or mitigation. Defense evasion may be considered a set of attributes the adversary applies to all other phases of the operation.\n                ",
            "ID": "TA0030",
            "Techniques": [
                {
                    "ID": "T1418",
                    "Name": "Application Discovery",
                    "Description": "Adversaries may seek to identify all applications installed on the device. One use case for doing so is to identify the presence of endpoint security applications that may increase the adversary's risk of detection. Another use case is to identify the presence of applications that the adversary may wish to target."
                },
                {
                    "ID": "T1408",
                    "Name": "Disguise Root/Jailbreak Indicators",
                    "Description": "An adversary could use knowledge of the techniques used by security software to evade detection. For example, some mobile security products perform compromised device detection by searching for particular artifacts such as an installed \"su\" binary, but that check could be evaded by naming the binary something else. Similarly, polymorphic code techniques could be used to evade signature-based detection as described by Rastogi et al. ."
                },
                {
                    "ID": "T1407",
                    "Name": "Download New Code at Runtime",
                    "Description": "An app could download and execute dynamic code (not included in the original application package) after installation to evade static analysis techniques (and potentially dynamic analysis techniques) used for application vetting or application store review . "
                },
                {
                    "ID": "T1478",
                    "Name": "Install Insecure or Malicious Configuration",
                    "Description": "An adversary could attempt to install insecure or malicious configuration settings on the mobile device, through means such as phishing emails or text messages either directly containing the configuration settings as an attachment, or containing a web link to the configuration settings. The device user may be tricked into installing the configuration settings through social engineering techniques ."
                },
                {
                    "ID": "T1398",
                    "Name": "Modify OS Kernel or Boot Partition",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device kernel or other boot partition components, where the code may evade detection, may persist after device resets, and may not be removable by the device user. In some cases (e.g., the Samsung Knox warranty bit as described under Detection), the attack may be detected but could result in the device being placed in a state that no longer allows certain functionality."
                },
                {
                    "ID": "T1400",
                    "Name": "Modify System Partition",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device system partition, where it may persist after device resets and may not be easily removed by the device user."
                },
                {
                    "ID": "T1399",
                    "Name": "Modify Trusted Execution Environment",
                    "Description": "If an adversary can escalate privileges, he or she may be able to use those privileges to place malicious code in the device's Trusted Execution Environment (TEE) or other similar isolated execution environment where the code can evade detection, may persist after device resets, and may not be removable by the device user. Running code within the TEE may provide an adversary with the ability to monitor or tamper with overall device behavior."
                },
                {
                    "ID": "T1406",
                    "Name": "Obfuscated or Encrypted Payload",
                    "Description": "An app could contain malicious code in obfuscated or encrypted form, then deobfuscate or decrypt the code at runtime to evade many app vetting techniques, as described in     ."
                }
            ]
        },
        "Credential Access": {
            "Name": "Credential Access",
            "Description": "Credential access represents techniques that can be used by adversaries to obtain access to or control over passwords, tokens, cryptographic keys, or other values that could be used by an adversary to gain unauthorized access to resources. Credential access allows the adversary to assume the identity of an account, with all of that account's permissions on the system and network, and makes it harder for defenders to detect the adversary. With sufficient access within a network, an adversary can create accounts for later use within the environment.\n                ",
            "ID": "TA0031",
            "Techniques": [
                {
                    "ID": "T1453",
                    "Name": "Abuse Accessibility Features",
                    "Description": "A malicious app could abuse Android's accessibility features to capture sensitive data or perform other malicious actions, as demonstrated in a proof of concept created by Skycure ."
                },
                {
                    "ID": "T1413",
                    "Name": "Access Sensitive Data in Device Logs",
                    "Description": "On versions of Android prior to 4.1, an adversary may use a malicious application that holds the READ_LOGS permission to obtain private keys, passwords, other credentials, or other sensitive data stored in the device's system log. On Android 4.1 and later, an adversary would need to attempt to perform an operating system privilege escalation attack to be able to access the log."
                },
                {
                    "ID": "T1409",
                    "Name": "Access Sensitive Data or Credentials in Files",
                    "Description": "An adversary could attempt to read files that contain sensitive data or credentials (e.g., private keys, passwords, access tokens). This technique requires either escalated privileges or for the targeted app to have stored the data in an insecure manner (e.g., with insecure file permissions or in an insecure location such as an external storage directory)."
                },
                {
                    "ID": "T1416",
                    "Name": "Android Intent Hijacking",
                    "Description": "A malicious app can register to receive intents meant for other applications and may then be able to receive sensitive values such as OAuth authorization codes as described in  ."
                },
                {
                    "ID": "T1414",
                    "Name": "Capture Clipboard Data",
                    "Description": "A malicious app or other attack vector could capture sensitive data stored in the device clipboard, for example passwords being copy-and-pasted from a password manager app."
                },
                {
                    "ID": "T1412",
                    "Name": "Capture SMS Messages",
                    "Description": "A malicious application could capture sensitive data sent via SMS, including authentication credentials. SMS is frequently used to transmit codes used for multi-factor authentication."
                },
                {
                    "ID": "T1405",
                    "Name": "Exploit TEE Vulnerability",
                    "Description": "A malicious app or other attack vector could be used to exploit vulnerabilities in code running within the Trusted Execution Environment (TEE) . The adversary could then obtain privileges held by the TEE potentially including the ability to access cryptographic keys or other sensitive data . Escalated operating system privileges may be first required in order to have the ability to attack the TEE . If not, privileges within the TEE can potentially be used to exploit the operating system ."
                },
                {
                    "ID": "T1417",
                    "Name": "Malicious Third Party Keyboard App",
                    "Description": "A malicious app can register as a device keyboard and intercept keypresses containing sensitive values such as usernames and passwords. Zeltser  describes these risks."
                },
                {
                    "ID": "T1410",
                    "Name": "Network Traffic Capture or Redirection",
                    "Description": "An adversary may capture network traffic to and from the device to obtain credentials or other sensitive data, or redirect network traffic to flow through an adversary-controlled gateway to do the same."
                },
                {
                    "ID": "T1415",
                    "Name": "URL Scheme Hijacking",
                    "Description": "An iOS application may be able to maliciously claim a URL scheme, allowing it to intercept calls that are meant for a different application. This technique, for example, could be used to capture OAuth authorization codes as described in   or to phish user credentials as described in  . Related potential security implications are described in  . FireEye researchers describe URL scheme hijacking in a blog post , including evidence of its use."
                },
                {
                    "ID": "T1411",
                    "Name": "User Interface Spoofing",
                    "Description": "User Interface Spoofing can be used to trick users into providing sensitive information, such as account credentials, bank account information, or Personally Identifiable Information (PII) to an unintended entity."
                }
            ]
        },
        "Discovery": {
            "Name": "Discovery",
            "Description": "Discovery consists of techniques that allow the adversary to gain knowledge about the characteristics of the mobile device and potentially other networked systems. When adversaries gain access to a new system, they must orient themselves to what they now have control of and what benefits operating from that system give to their current objective or overall goals during the intrusion. The operating system may provide capabilities that aid in this post-compromise information-gathering phase.\n                ",
            "ID": "TA0032",
            "Techniques": [
                {
                    "ID": "T1418",
                    "Name": "Application Discovery",
                    "Description": "Adversaries may seek to identify all applications installed on the device. One use case for doing so is to identify the presence of endpoint security applications that may increase the adversary's risk of detection. Another use case is to identify the presence of applications that the adversary may wish to target."
                },
                {
                    "ID": "T1419",
                    "Name": "Device Type Discovery",
                    "Description": "On Android, device type information is accessible to apps through the android.os.Build class . Device information could be used to target privilege escalation exploits."
                },
                {
                    "ID": "T1420",
                    "Name": "File and Directory Discovery",
                    "Description": "On Android, command line tools or the Java file APIs can be used to enumerate file system contents. However, Linux file permissions and SELinux policies generally strongly restrict what can be accessed by apps (without taking advantage of a privilege escalation exploit). The contents of the external storage directory are generally visible, which could present concern if sensitive data is inappropriately stored there."
                },
                {
                    "ID": "T1422",
                    "Name": "Local Network Configuration Discovery",
                    "Description": "On Android, details of onboard network interfaces are accessible to apps through the java.net.NetworkInterface class . The Android TelephonyManager class can be used to gather related information such as the IMSI, IMEI, and phone number ."
                },
                {
                    "ID": "T1421",
                    "Name": "Local Network Connections Discovery",
                    "Description": "On Android, applications can use standard APIs to gather a list of network connections to and from the device. For example, the Network Connections app available in the Google Play Store  advertises this functionality."
                },
                {
                    "ID": "T1423",
                    "Name": "Network Service Scanning",
                    "Description": "Adversaries may attempt to get a listing of services running on remote hosts, including those that may be vulnerable to remote software exploitation. Methods to acquire this information include port scans and vulnerability scans from the mobile device. This technique may take advantage of the mobile device's access to an internal enterprise network either through local connectivity or through a Virtual Private Network (VPN)."
                },
                {
                    "ID": "T1424",
                    "Name": "Process Discovery",
                    "Description": "On Android versions prior to 5, applications can observe information about other processes that are running through methods in the ActivityManager class. On Android versions prior to 7, applications can obtain this information by executing the ps command, or by examining the /proc directory. Starting in Android version 7, use of the Linux kernel's hidepid feature prevents applications (without escalated privileges) from accessing this information ."
                },
                {
                    "ID": "T1426",
                    "Name": "System Information Discovery",
                    "Description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, and architecture."
                }
            ]
        },
        "Lateral Movement": {
            "Name": "Lateral Movement",
            "Description": "Lateral movement consists of techniques that enable an adversary to access and control remote systems on a network and could, but does not necessarily, include execution of tools on remote systems. The lateral movement techniques could allow an adversary to gather information from a system without needing additional tools, such as a remote access tool.\n                ",
            "ID": "TA0033",
            "Techniques": [
                {
                    "ID": "T1427",
                    "Name": "Attack PC via USB Connection",
                    "Description": "With escalated privileges, an adversary could program the mobile device to impersonate USB devices such as input devices (keyboard and mouse), storage devices, and/or networking devices in order to attack a physically connected PC. Wang and Stavrou  and Kamkar  describe this technique. This technique has been demonstrated on Android, and we are unaware of any demonstrations on iOS."
                },
                {
                    "ID": "T1428",
                    "Name": "Exploit Enterprise Resources",
                    "Description": "Adversaries may attempt to exploit enterprise servers, workstations, or other resources over the network. This technique may take advantage of the mobile device's access to an internal enterprise network either through local connectivity or through a Virtual Private Network (VPN)."
                }
            ]
        },
        "Effects": {
            "Name": "Effects",
            "Description": "Effects consists of techniques used by the adversary to execute his or her mission objectives but that do not cleanly fit into another category such as Collection. Mission objectives vary based on each adversary's goals, but examples include toll fraud, destruction of device data, or locking the user out of his or her device until a ransom is paid.\n                ",
            "ID": "TA0034",
            "Techniques": [
                {
                    "ID": "T1471",
                    "Name": "Encrypt Files for Ransom",
                    "Description": "An adversary may encrypt files stored on the mobile device to prevent the user from accessing them, only unlocking access to the files after a ransom is paid. Without escalated privileges, the adversary is generally limited to only encrypting files in external/shared storage locations. This technique has been demonstrated on Android, and we are unaware of any demonstrated use on iOS."
                },
                {
                    "ID": "T1472",
                    "Name": "Generate Fraudulent Advertising Revenue",
                    "Description": "An adversary could seek to generate fraudulent advertising revenue from mobile devices, for example by triggering automatic clicks of advertising links without user involvement."
                },
                {
                    "ID": "T1446",
                    "Name": "Lock User Out of Device",
                    "Description": "An adversary may seek to lock the legitimate user out of the device, for example until a ransom is paid."
                },
                {
                    "ID": "T1452",
                    "Name": "Manipulate App Store Rankings or Ratings",
                    "Description": "An adversary could use access to a compromised device's credentials to attempt to manipulate app store rankings or ratings by triggering application downloads or posting fake reviews of applications. This technique likely requires privileged access (a rooted or jailbroken device)."
                },
                {
                    "ID": "T1448",
                    "Name": "Premium SMS Toll Fraud",
                    "Description": "A malicious app could use standard Android APIs to send SMS messages. SMS messages could potentially be sent to premium numbers that charge the device owner and generate revenue for an adversary, for example as described by Lookout in  ."
                },
                {
                    "ID": "T1447",
                    "Name": "Wipe Device Data",
                    "Description": "A malicious application could abuse Android device administrator access to wipe device contents, for example if a ransom is not paid."
                }
            ]
        },
        "Collection": {
            "Name": "Collection",
            "Description": "Collection consists of techniques used to identify and gather information, such as sensitive files, from a target network prior to exfiltration. This category also covers locations on a system or network where the adversary may look for information to exfiltrate.\n                ",
            "ID": "TA0035",
            "Techniques": [
                {
                    "ID": "T1453",
                    "Name": "Abuse Accessibility Features",
                    "Description": "A malicious app could abuse Android's accessibility features to capture sensitive data or perform other malicious actions, as demonstrated in a proof of concept created by Skycure ."
                },
                {
                    "ID": "T1435",
                    "Name": "Access Calendar Entries",
                    "Description": "An adversary could call standard operating system APIs from a malicious application to gather calendar entry data, or with escalated privileges could directly access files containing calendar data."
                },
                {
                    "ID": "T1433",
                    "Name": "Access Call Log",
                    "Description": "On Android, an adversary could call standard operating system APIs from a malicious application to gather call log data, or with escalated privileges could directly access files containing call log data."
                },
                {
                    "ID": "T1432",
                    "Name": "Access Contact List",
                    "Description": "An adversary could call standard operating system APIs from a malicious application to gather contact list (i.e., address book) data, or with escalated privileges could directly access files containing contact list data."
                },
                {
                    "ID": "T1413",
                    "Name": "Access Sensitive Data in Device Logs",
                    "Description": "On versions of Android prior to 4.1, an adversary may use a malicious application that holds the READ_LOGS permission to obtain private keys, passwords, other credentials, or other sensitive data stored in the device's system log. On Android 4.1 and later, an adversary would need to attempt to perform an operating system privilege escalation attack to be able to access the log."
                },
                {
                    "ID": "T1409",
                    "Name": "Access Sensitive Data or Credentials in Files",
                    "Description": "An adversary could attempt to read files that contain sensitive data or credentials (e.g., private keys, passwords, access tokens). This technique requires either escalated privileges or for the targeted app to have stored the data in an insecure manner (e.g., with insecure file permissions or in an insecure location such as an external storage directory)."
                },
                {
                    "ID": "T1414",
                    "Name": "Capture Clipboard Data",
                    "Description": "A malicious app or other attack vector could capture sensitive data stored in the device clipboard, for example passwords being copy-and-pasted from a password manager app."
                },
                {
                    "ID": "T1412",
                    "Name": "Capture SMS Messages",
                    "Description": "A malicious application could capture sensitive data sent via SMS, including authentication credentials. SMS is frequently used to transmit codes used for multi-factor authentication."
                },
                {
                    "ID": "T1430",
                    "Name": "Location Tracking",
                    "Description": "An adversary could use a malicious or exploited application to surreptitiously track the device's physical location through use of standard operating system APIs."
                },
                {
                    "ID": "T1417",
                    "Name": "Malicious Third Party Keyboard App",
                    "Description": "A malicious app can register as a device keyboard and intercept keypresses containing sensitive values such as usernames and passwords. Zeltser  describes these risks."
                },
                {
                    "ID": "T1429",
                    "Name": "Microphone or Camera Recordings",
                    "Description": "An adversary could use a malicious or exploited application to surreptitiously record activities using the device microphone and/or camera through use of standard operating system APIs."
                },
                {
                    "ID": "T1410",
                    "Name": "Network Traffic Capture or Redirection",
                    "Description": "An adversary may capture network traffic to and from the device to obtain credentials or other sensitive data, or redirect network traffic to flow through an adversary-controlled gateway to do the same."
                }
            ]
        },
        "Exfiltration": {
            "Name": "Exfiltration",
            "Description": "Exfiltration refers to techniques and attributes that result or aid in the adversary removing files and information from the targeted mobile device.In the mobile environment, mobile devices are frequently connected to networks outside enterprise control such as cellular networks or public Wi-Fi networks. Adversaries could attempt to evade detection by communicating on these networks, and potentially even by using non-Internet Protocol mechanisms such as Short Message Service (SMS). However, cellular networks often have data caps and/or extra data charges that could increase the potential for adversarial communication to be detected.\n                ",
            "ID": "TA0036",
            "Techniques": [
                {
                    "ID": "T1438",
                    "Name": "Alternate Network Mediums",
                    "Description": "Adversaries can communicate using cellular networks rather than enterprise Wi-Fi in order to bypass enterprise network monitoring systems. Adversaries may also communicate using other non-Internet Protocol mediums such as SMS, NFC, or Bluetooth to bypass network monitoring systems."
                },
                {
                    "ID": "T1436",
                    "Name": "Commonly Used Port",
                    "Description": "Adversaries may communicate over a commonly used port to bypass firewalls or network detection systems and to blend with normal network activity to avoid more detailed inspection. They may use commonly open ports such as"
                },
                {
                    "ID": "T1437",
                    "Name": "Standard Application Layer Protocol",
                    "Description": "Adversaries may communicate using a common, standardized application layer protocol such as HTTP, HTTPS, SMTP, or DNS to avoid detection by blending in with existing traffic."
                }
            ]
        },
        "Command and Control": {
            "Name": "Command and Control",
            "Description": "The command and control tactic represents how adversaries communicate with systems under their control within a target network. There are many ways an adversary can establish command and control with various levels of covertness, depending on system configuration and network topology. Due to the wide degree of variation available to the adversary at the network level, only the most common factors were used to describe the differences in command and control. There are still a great many specific techniques within the documented methods, largely due to how easy it is to define new protocols and use existing, legitimate protocols and network services for communication. The resulting breakdown should help convey the concept that detecting intrusion through command and control protocols without prior knowledge is a difficult proposition over the long term. Adversaries' main constraints in network-level defense avoidance are testing and deployment of tools to rapidly change their protocols, awareness of existing defensive technologies, and access to legitimate Web services that, when used appropriately, make their tools difficult to distinguish from benign traffic.Additionally, in the mobile environment, mobile devices are frequently connected to networks outside enterprise control such as cellular networks or public Wi-Fi networks. Adversaries could attempt to evade detection by communicating on these networks, and potentially even by using non-Internet Protocol mechanisms such as Short Message Service (SMS). However, cellular networks often have data caps and/or extra data charges that could increase the potential for adversarial communication to be detected.\n                ",
            "ID": "TA0037",
            "Techniques": [
                {
                    "ID": "T1438",
                    "Name": "Alternate Network Mediums",
                    "Description": "Adversaries can communicate using cellular networks rather than enterprise Wi-Fi in order to bypass enterprise network monitoring systems. Adversaries may also communicate using other non-Internet Protocol mediums such as SMS, NFC, or Bluetooth to bypass network monitoring systems."
                },
                {
                    "ID": "T1436",
                    "Name": "Commonly Used Port",
                    "Description": "Adversaries may communicate over a commonly used port to bypass firewalls or network detection systems and to blend with normal network activity to avoid more detailed inspection. They may use commonly open ports such as"
                },
                {
                    "ID": "T1437",
                    "Name": "Standard Application Layer Protocol",
                    "Description": "Adversaries may communicate using a common, standardized application layer protocol such as HTTP, HTTPS, SMTP, or DNS to avoid detection by blending in with existing traffic."
                }
            ]
        },
        "Network Effects": {
            "Name": "Network Effects",
            "Description": "This category refers to network-based techniques that an adversary may be able to use to fulfill his or her objectives without access to the mobile device itself. These include techniques to intercept or manipulate network traffic to and from the mobile device.\n                ",
            "ID": "TA0038",
            "Techniques": [
                {
                    "ID": "T1466",
                    "Name": "Downgrade to Insecure Protocols",
                    "Description": "An adversary could cause the mobile device to use less secure protocols, for example by jamming frequencies used by newer protocols such as LTE and only allowing older protocols such as GSM to communicate as described in NIST SP 800-187 . Use of less secure protocols may make communication easier to eavesdrop upon or manipulate."
                },
                {
                    "ID": "T1439",
                    "Name": "Eavesdrop on Insecure Network Communication",
                    "Description": "If network traffic between the mobile device and remote servers is unencrypted or is encrypted in an insecure manner, then an adversary positioned on the network can eavesdrop on communication. For example, He et al.  describe numerous healthcare-related applications that did not properly protect network communication."
                },
                {
                    "ID": "T1449",
                    "Name": "Exploit SS7 to Redirect Phone Calls/SMS",
                    "Description": "An adversary could exploit signaling system vulnerabilities to redirect calls or text messages to a phone number under the attacker's control. The adversary could then act as a man-in-the-middle to intercept or manipulate the communication.     "
                },
                {
                    "ID": "T1450",
                    "Name": "Exploit SS7 to Track Device Location",
                    "Description": "An adversary could exploit signaling system vulnerabilities to track the location of mobile devices.     "
                },
                {
                    "ID": "T1464",
                    "Name": "Jamming or Denial of Service",
                    "Description": "An attacker could jam radio signals (e.g. Wi-Fi, cellular, GPS) to prevent the mobile device from communicating. "
                },
                {
                    "ID": "T1463",
                    "Name": "Manipulate Device Communication",
                    "Description": "If network traffic between the mobile device and a remote server is not securely protected, then an attacker positioned on the network may be able to manipulate network communication without being detected. For example, FireEye researchers found in 2014 that 68% of the top 1,000 free applications in the Google Play Store had at least one Transport Layer Security (TLS) implementation vulnerability potentially opening the applications' network traffic to man-in-the-middle attacks ."
                },
                {
                    "ID": "T1467",
                    "Name": "Rogue Cellular Base Station",
                    "Description": "An adversary could set up a rogue cellular base station and then use it to eavesdrop on or manipulate cellular device communication. For example, Ritter and DePerry of iSEC Partners demonstrated this technique using a compromised cellular femtocell at Black Hat USA 2013 ."
                },
                {
                    "ID": "T1465",
                    "Name": "Rogue Wi-Fi Access Points",
                    "Description": "An adversary could set up unauthorized Wi-Fi access points or compromise existing access points and, if the device connects to them, carry out network-based attacks such as eavesdropping on or modifying network communication as described in NIST SP 800-153 . "
                },
                {
                    "ID": "T1451",
                    "Name": "SIM Card Swap",
                    "Description": "An adversary could convince the mobile network operator (e.g. through social networking, forged identification, or insider attacks performed by trusted employees) to issue a new SIM card and associate it with an existing phone number and account  . The adversary could then obtain SMS messages or hijack phone calls intended for someone else . "
                }
            ]
        },
        "Remote Service Effects": {
            "Name": "Remote Service Effects",
            "Description": "This category refers to techniques involving remote services, such as vendor-provided cloud services (e.g. Google Drive, Google Find My Device, or Apple iCloud), or enterprise mobility management (EMM)/mobile device management (MDM) services that an adversary may be able to use to fulfill his or her objectives without access to the mobile device itself.\n                ",
            "ID": "TA0039",
            "Techniques": [
                {
                    "ID": "T1470",
                    "Name": "Obtain Device Cloud Backups",
                    "Description": "An adversary who is able to obtain unauthorized access to or misuse authorized access to cloud backup services (e.g. Google's Android backup service or Apple's iCloud) could use that access to obtain sensitive data stored in device backups. For example, the Elcomsoft Phone Breaker product advertises the ability to retrieve iOS backup data from Apple's iCloud . Elcomsoft also describes  obtaining WhatsApp communication histories from backups stored in iCloud."
                },
                {
                    "ID": "T1468",
                    "Name": "Remotely Track Device Without Authorization",
                    "Description": "An adversary who is able to obtain unauthorized access to or misuse authorized access to cloud services (e.g. Google's Android Device Manager or Apple iCloud's Find my iPhone) or to an enterprise mobility management (EMM) / mobile device management (MDM) server console could use that access to track mobile devices."
                },
                {
                    "ID": "T1469",
                    "Name": "Remotely Wipe Data Without Authorization",
                    "Description": "An adversary who is able to obtain unauthorized access to or misuse authorized access to cloud services (e.g. Google's Android Device Manager or Apple iCloud's Find my iPhone) or to an EMM console could use that access to wipe enrolled devices ."
                }
            ]
        }
    },
    "PRE-ATT&CK": {
        "Priority Definition Planning": {
            "Name": "Priority Definition Planning",
            "Description": "Priority definition planning consists of the process of determining the set of Key Intelligence Topics (KIT) or Key Intelligence Questions (KIQ) required for meeting key strategic, operational, or tactical goals.  Leadership outlines the priority definition (may be considered a goal) around which the adversary designs target selection and a plan to achieve.  An analyst may outline the priority definition when in the course of determining gaps in existing KITs or KIQs.\n                ",
            "ID": "TA0012",
            "Techniques": [
                {
                    "ID": "T1236",
                    "Name": "Assess current holdings, needs, and wants",
                    "Description": "Analysts assess current information available against requirements that outline needs and wants as part of the research baselining process to begin satisfying a requirement.    "
                },
                {
                    "ID": "T1229",
                    "Name": "Assess KITs/KIQs benefits",
                    "Description": "Key Intelligence Topics (KITs) and Key Intelligence Questions (KIQs) may be further subdivided to focus on political, economic, diplomatic, military, financial, or intellectual property categories.  An adversary may specify KITs or KIQs in this manner in order to understand how the information they are pursuing can have multiple uses and to consider all aspects of the types of information they need to target for a particular purpose.  KIT."
                },
                {
                    "ID": "T1224",
                    "Name": "Assess leadership areas of interest",
                    "Description": "Leadership assesses the areas of most interest to them and generates Key Intelligence Topics (KIT) or Key Intelligence Questions (KIQ). For example, an adversary knows from open and closed source reporting that cyber is of interest, resulting in it being a KIT. "
                },
                {
                    "ID": "T1228",
                    "Name": "Assign KITs/KIQs into categories",
                    "Description": "Leadership organizes Key Intelligence Topics (KITs) and Key Intelligence Questions (KIQs) into three types of categories and creates more if necessary.  An example of a description of key players KIT would be when an adversary assesses the cyber defensive capabilities of a nation-state threat actor. "
                },
                {
                    "ID": "T1226",
                    "Name": "Conduct cost/benefit analysis",
                    "Description": "Leadership conducts a cost/benefit analysis that generates a compelling need for information gathering which triggers a Key Intelligence Toptic (KIT) or Key Intelligence Question (KIQ). For example, an adversary compares the cost of cyber intrusions with the expected benefits from increased intelligence collection on cyber adversaries.  "
                },
                {
                    "ID": "T1232",
                    "Name": "Create implementation plan",
                    "Description": "Implementation plans specify how the goals of the strategic plan will be executed.  "
                },
                {
                    "ID": "T1231",
                    "Name": "Create strategic plan",
                    "Description": "Strategic plans outline the mission, vision, and goals for an adversary at a high level in relation to the key partners, topics, and functions the adversary carries out.   "
                },
                {
                    "ID": "T1230",
                    "Name": "Derive intelligence requirements",
                    "Description": "Leadership or key decision makers may derive specific intelligence requirements from Key Intelligence Topics (KITs) or Key Intelligence Questions (KIQs).  Specific intelligence requirements assist analysts in gathering information to establish a baseline of information about a topic or question and collection managers to clarify the types of information that should be collected to satisfy the requirement.  "
                },
                {
                    "ID": "T1227",
                    "Name": "Develop KITs/KIQs",
                    "Description": "Leadership derives Key Intelligence Topics (KITs) and Key Intelligence Questions (KIQs) from the areas of most interest to them.  KITs are an expression of management's intelligence needs with respect to early warning, strategic and operational decisions, knowing the competition, and understanding the competitive situation. KIQs are the critical questions aligned by KIT which provide the basis for collection plans, create a context for analytic work, and/or identify necessary external operations. "
                },
                {
                    "ID": "T1234",
                    "Name": "Generate analyst intelligence requirements",
                    "Description": "Analysts may receive Key Intelligence Topics (KITs) and Key Intelligence Questions (KIQs) from leadership or key decision makers and generate intelligence requirements to articulate intricacies of information required on a topic or question. "
                },
                {
                    "ID": "T1233",
                    "Name": "Identify analyst level gaps",
                    "Description": "Analysts identify gap areas that generate a compelling need to generate a Key Intelligence Topic (KIT) or Key Intelligence Question (KIQ).   "
                },
                {
                    "ID": "T1225",
                    "Name": "Identify gap areas",
                    "Description": "Leadership identifies gap areas that generate a compelling need to generate a Key Intelligence Topic (KIT) or Key Intelligence Question (KIQ).  "
                },
                {
                    "ID": "T1235",
                    "Name": "Receive operator KITs/KIQs tasking",
                    "Description": "Analysts may receive intelligence requirements from leadership and begin research process to satisfy a requirement.  Part of this process may include delineating between needs and wants and thinking through all the possible aspects associating with satisfying a requirement. "
                }
            ]
        },
        "Priority Definition Direction": {
            "Name": "Priority Definition Direction",
            "Description": "Priority definition direction consists of the process of collecting and assigning requirements for meeting Key Intelligence Topics (KIT) or Key Intelligence Questions (KIQ) as determined by leadership.\n                ",
            "ID": "TA0013",
            "Techniques": [
                {
                    "ID": "T1238",
                    "Name": "Assign KITs, KIQs, and/or intelligence requirements",
                    "Description": "Once generated, Key Intelligence Topics (KITs), Key Intelligence Questions (KIQs), and/or intelligence requirements are assigned to applicable agencies and/or personnel. For example, an adversary may decide nuclear energy requirements should be assigned to a specific organization based on their mission.  "
                },
                {
                    "ID": "T1239",
                    "Name": "Receive KITs/KIQs and determine requirements",
                    "Description": "Applicable agencies and/or personnel receive intelligence requirements and evaluate them to determine sub-requirements related to topics, questions, or requirements.  For example, an adversary's  nuclear energy requirements may be further divided into nuclear facilities versus nuclear warhead capabilities. "
                },
                {
                    "ID": "T1237",
                    "Name": "Submit KITs, KIQs, and intelligence requirements",
                    "Description": "Once they have been created, intelligence requirements, Key Intelligence Topics (KITs), and Key Intelligence Questions (KIQs) are submitted into a central management system.  "
                },
                {
                    "ID": "T1240",
                    "Name": "Task requirements",
                    "Description": "Once divided into the most granular parts, analysts work with collection managers to task the collection management system with requirements and sub-requirements.  "
                }
            ]
        },
        "Target Selection": {
            "Name": "Target Selection",
            "Description": "Target selection consists of an iterative process in which an adversary determines a target by first beginning at the strategic level and then narrowing down operationally and tactically until a specific target is chosen.  A target may be defined as an entity or object that performs a function considered for possible engagement or other action.\n                ",
            "ID": "TA0014",
            "Techniques": [
                {
                    "ID": "T1245",
                    "Name": "Determine approach/attack vector",
                    "Description": "The approach or attack vector outlines the specifics behind how the adversary would like to attack the target.  As additional information is known through the other phases of PRE-ATT&CK, an adversary may update the approach or attack vector.     "
                },
                {
                    "ID": "T1243",
                    "Name": "Determine highest level tactical element",
                    "Description": "From a tactical viewpoint, an adversary could potentially have a primary and secondary level target.  The primary target represents the highest level tactical element the adversary wishes to attack.  For example, the corporate network within a corporation or the division within an agency.    "
                },
                {
                    "ID": "T1242",
                    "Name": "Determine operational element",
                    "Description": "If going from strategic down to tactical or vice versa, an  adversary would next consider the operational element.  For example, the specific company within an industry or agency within a government.    "
                },
                {
                    "ID": "T1244",
                    "Name": "Determine secondary level tactical element",
                    "Description": "The secondary level tactical element the adversary seeks to attack is the specific network or area of a network that is vulnerable to attack.  Within the corporate network example, the secondary level tactical element might be a SQL server or a domain controller with a known vulnerability.    "
                },
                {
                    "ID": "T1241",
                    "Name": "Determine strategic target",
                    "Description": "An adversary undergoes an iterative target selection process that may begin either broadly and narrow down into specifics (strategic to tactical) or narrowly and expand outward (tactical to strategic).  As part of this process, an adversary may determine a high level target they wish to attack. One example of this may be a particular country, government, or commercial sector.    "
                }
            ]
        },
        "Technical Information Gathering": {
            "Name": "Technical Information Gathering",
            "Description": "Technical information gathering consists of the process of identifying critical technical elements of intelligence an adversary will need about a target in order to best attack.  Technical intelligence gathering includes, but is not limited to, understanding the target's network architecture, IP space, network services, email format, and security procedures.\n                ",
            "ID": "TA0015",
            "Techniques": [
                {
                    "ID": "T1247",
                    "Name": "Acquire OSINT data sets and information",
                    "Description": "Open source intelligence (OSINT) is intelligence gathered from publicly available sources. This can include both information gathered on-line, such as from search engines, as well as in the physical world. "
                },
                {
                    "ID": "T1254",
                    "Name": "Conduct active scanning",
                    "Description": "Active scanning is the act of sending transmissions to end nodes, and analyzing the responses, in order to identify information about the communications system. "
                },
                {
                    "ID": "T1253",
                    "Name": "Conduct passive scanning",
                    "Description": "Passive scanning is the act of looking at existing network traffic in order to identify information about the communications system.  "
                },
                {
                    "ID": "T1249",
                    "Name": "Conduct social engineering",
                    "Description": "Social Engineering is the practice of manipulating people in order to get them to divulge information or take an action.  "
                },
                {
                    "ID": "T1260",
                    "Name": "Determine 3rd party infrastructure services",
                    "Description": "Infrastructure services includes the hardware, software, and network resources required to operate a communications environment. This infrastructure can be managed by a 3rd party rather than being managed by the owning organization.  "
                },
                {
                    "ID": "T1250",
                    "Name": "Determine domain and IP address space",
                    "Description": "Domain Names are the human readable names used to represent one or more IP addresses. IP addresses are the unique identifier of computing devices on a network. Both pieces of information are valuable to an adversary who is looking to understand the structure of a network. "
                },
                {
                    "ID": "T1259",
                    "Name": "Determine external network trust dependencies",
                    "Description": "Network trusts enable communications between different networks with specific accesses and permissions. Network trusts could include the implementation of domain trusts or the use of virtual private networks (VPNs).   "
                },
                {
                    "ID": "T1258",
                    "Name": "Determine firmware version",
                    "Description": "Firmware is permanent software programmed into the read-only memory of a device. As with other types of software, firmware may be updated over time and have multiple versions. "
                },
                {
                    "ID": "T1255",
                    "Name": "Discover target logon/email address format",
                    "Description": "Email addresses, logon credentials, and other forms of online identification typically share a common format. This makes guessing other credentials within the same domain easier. For example if a known email address is first.last@company.com it is likely that others in the company will have an email in the same format. "
                },
                {
                    "ID": "T1262",
                    "Name": "Enumerate client configurations",
                    "Description": "Client configurations information such as the operating system and web browser, along with additional information such as version or language, are often transmitted as part of web browsing communications.  This can be accomplished in several ways including use of a compromised web site to collect details on visiting computers.  "
                },
                {
                    "ID": "T1261",
                    "Name": "Enumerate externally facing software applications technologies, languages, and dependencies",
                    "Description": "Software applications will be built using different technologies, languages, and dependencies. This information may reveal vulnerabilities or opportunities to an adversary.   "
                },
                {
                    "ID": "T1248",
                    "Name": "Identify job postings and needs/gaps",
                    "Description": "Job postings, on either company sites, or in other forums, provide information on organizational structure and often provide contact information for someone within the organization. This may give an adversary  information on technologies within the organization which could be valuable in attack or provide insight in to possible security weaknesses or limitations in detection or protection mechanisms. "
                },
                {
                    "ID": "T1263",
                    "Name": "Identify security defensive capabilities",
                    "Description": "Security defensive capabilities are designed to stop or limit unauthorized network traffic or other types of accesses.  "
                },
                {
                    "ID": "T1246",
                    "Name": "Identify supply chains",
                    "Description": "Supply chains include the people, processes, and technologies used to move a product or service from a supplier to a consumer. Understanding supply chains may provide an adversary with opportunities to exploit the technology or interconnections that are part of the supply chain.   "
                },
                {
                    "ID": "T1264",
                    "Name": "Identify technology usage patterns",
                    "Description": "Technology usage patterns include identifying if users work offsite, connect remotely, or other possibly less restricted/secured access techniques. "
                },
                {
                    "ID": "T1256",
                    "Name": "Identify web defensive services",
                    "Description": "An adversary can attempt to identify web defensive services as CloudFlare, IPBan, and Snort. This may be done by passively detecting services, like CloudFlare routing, or actively, such as by purposefully tripping security defenses. "
                },
                {
                    "ID": "T1252",
                    "Name": "Map network topology",
                    "Description": "A network topology is the arrangement of the various elements of a network (e.g., servers, workstations, printers, routers, firewalls, etc.). Mapping a network allows an adversary to understand how the elements are connected or related.  "
                },
                {
                    "ID": "T1257",
                    "Name": "Mine technical blogs/forums",
                    "Description": "Technical blogs and forums provide a way for technical staff to ask for assistance or troubleshoot problems. In doing so they may reveal information such as operating system (OS), network devices, or applications in use. "
                },
                {
                    "ID": "T1251",
                    "Name": "Obtain domain/IP registration information",
                    "Description": "For a computing resource to be accessible to the public, domain names and IP addresses must be registered with an authorized organization.   "
                },
                {
                    "ID": "T1397",
                    "Name": "Spearphishing for Information",
                    "Description": "Spearphishing for information is a specific variant of spearphishing. Spearphishing for information is different from other forms of spearphishing in that it it doesn't leverage malicious code. All forms of spearphishing are elctronically delivered social engineering targeted at a specific individual, company, or industry. Spearphishing for information is an attempt to trick targets into divulging information, frequently credentials, without involving malicious code. Spearphishing for information frequently involves masquerading as a source with a reason to collect information (such as a system administrator or a bank) and providing a user with a website link to visit. The given website often closely resembles a legitimate site in appearance and has a URL containing elements from the real site. From the fake website, information is gathered in web forms and sent to the attacker. Spearphishing for information may also try to obtain information directly through the exchange of emails, instant messengers or other electronic conversation means. "
                }
            ]
        },
        "People Information Gathering": {
            "Name": "People Information Gathering",
            "Description": "People Information Gathering consists of the process of identifying critical personnel elements of intelligence an adversary will need about a target in order to best attack.  People intelligence gathering focuses on identifying key personnel or individuals with critical accesses in order to best approach a target for attack.  It may involve aspects of social engineering, elicitation, mining social media sources, or be thought of as understanding the personnel element of competitive intelligence.\n                ",
            "ID": "TA0016",
            "Techniques": [
                {
                    "ID": "T1266",
                    "Name": "Acquire OSINT data sets and information",
                    "Description": "Open source intelligence (OSINT) provides free, readily available information about a target while providing the target no indication they are of interest.  Such information can assist an adversary in crafting a successful approach for compromise. "
                },
                {
                    "ID": "T1275",
                    "Name": "Aggregate individual's digital footprint",
                    "Description": "In addition to a target's social media presence may exist a larger digital footprint, such as accounts and credentials on e-commerce sites or usernames and logins for email.  An adversary familiar with a target's username can mine to determine the target's larger digital footprint via publicly available sources.  "
                },
                {
                    "ID": "T1268",
                    "Name": "Conduct social engineering",
                    "Description": "Social Engineering is the practice of manipulating people in order to get them to divulge information or take an action.  "
                },
                {
                    "ID": "T1272",
                    "Name": "Identify business relationships",
                    "Description": "Business relationship information includes the associates of a target and may be discovered via social media sites such as LinkedIn or public press releases announcing new partnerships between organizations or people (such as key hire announcements in industry articles).  This information may be used by an adversary to shape social engineering attempts (exploiting who a target expects to hear from) or to plan for technical actions such as exploiting network trust relationship.  "
                },
                {
                    "ID": "T1270",
                    "Name": "Identify groups/roles",
                    "Description": "Personnel internally to a company may belong to a group or maintain a role with  electronic specialized access, authorities, or privilege that make them an attractive target for an adversary.  One example of this is a system administrator. "
                },
                {
                    "ID": "T1267",
                    "Name": "Identify job postings and needs/gaps",
                    "Description": "Job postings, on either company sites, or in other forums, provide information on organizational structure and often provide contact information for someone within the organization. This may give an adversary  information on people within the organization which could be valuable in social engineering attempts. "
                },
                {
                    "ID": "T1269",
                    "Name": "Identify people of interest",
                    "Description": "The attempt to identify people of interest or with an inherent weakness for direct or indirect targeting to determine an approach to compromise a person or organization.  Such targets may include individuals with poor OPSEC practices or those who have a trusted relationship with the intended target.  "
                },
                {
                    "ID": "T1271",
                    "Name": "Identify personnel with an authority/privilege",
                    "Description": "Personnel internally to a company may have non-electronic specialized access, authorities, or privilege that make them an attractive target for an adversary.  One example of this is an individual with financial authority to authorize large transactions.  An adversary who compromises this individual might be able to subvert large dollar transfers. "
                },
                {
                    "ID": "T1274",
                    "Name": "Identify sensitive personnel information",
                    "Description": "An adversary may identify sensitive personnel information not typically posted on a social media site, such as address, marital status, financial history, and law enforcement infractions. This could be conducted by searching public records that are frequently available for free or at a low cost online. "
                },
                {
                    "ID": "T1265",
                    "Name": "Identify supply chains",
                    "Description": "Supply chains include the people, processes, and technologies used to move a product or service from a supplier to a consumer. Understanding supply chains may provide an adversary with opportunities to exploit the people, their positions, and relationships, that are part of the supply chain.  "
                },
                {
                    "ID": "T1273",
                    "Name": "Mine social media",
                    "Description": "An adversary may research available open source information about a target commonly found on social media sites such as Facebook, Instagram, or Pinterest.  Social media is public by design and provides insight into the interests and potentially inherent weaknesses of a target for exploitation by the adversary. "
                }
            ]
        },
        "Organizational Information Gathering": {
            "Name": "Organizational Information Gathering",
            "Description": "Organizational information gathering consists of the process of identifying critical organizational elements of intelligence an adversary will need about a target in order to best attack.  Similar to competitive intelligence, organizational intelligence gathering focuses on understanding the operational tempo of an organization and gathering a deep understanding of the organization and how it operates, in order to best develop a strategy to target it.\n                ",
            "ID": "TA0017",
            "Techniques": [
                {
                    "ID": "T1277",
                    "Name": "Acquire OSINT data sets and information",
                    "Description": "Data sets can be anything from Security Exchange Commission (SEC) filings to public phone numbers. Many datasets are now either publicly available for free or can be purchased from a variety of data vendors.  Open source intelligence (OSINT) is intelligence gathered from publicly available sources. This can include both information gathered on-line as well as in the physical world.   "
                },
                {
                    "ID": "T1279",
                    "Name": "Conduct social engineering",
                    "Description": "Social Engineering is the practice of manipulating people in order to get them to divulge information or take an action.  "
                },
                {
                    "ID": "T1284",
                    "Name": "Determine 3rd party infrastructure services",
                    "Description": "A wide variety of cloud, virtual private services, hosting, compute, and storage solutions are available as 3rd party infrastructure services. These services could provide an adversary with another avenue of approach or compromise.   "
                },
                {
                    "ID": "T1285",
                    "Name": "Determine centralization of IT management",
                    "Description": "Determining if a \"corporate\" help desk exists, the degree of access and control it has, and whether there are \"edge\" units that may have different support processes and standards. "
                },
                {
                    "ID": "T1282",
                    "Name": "Determine physical locations",
                    "Description": "Physical locality information may be used by an adversary to shape social engineering attempts (language, culture, events, weather, etc.) or to plan for physical actions such as dumpster diving or attempting to access a facility. "
                },
                {
                    "ID": "T1286",
                    "Name": "Dumpster dive",
                    "Description": "Dumpster diving is looking through waste for information on technology, people, and/or organizational items of interest. "
                },
                {
                    "ID": "T1280",
                    "Name": "Identify business processes/tempo",
                    "Description": "Understanding an organizations business processes and tempo may allow an adversary to more effectively craft social engineering attempts or to better hide technical actions, such as those that generate network traffic.  "
                },
                {
                    "ID": "T1283",
                    "Name": "Identify business relationships",
                    "Description": "Business relationship information may be used by an adversary to shape social engineering attempts (exploiting who a target expects to hear from) or to plan for technical actions such as exploiting network trust relationship. "
                },
                {
                    "ID": "T1278",
                    "Name": "Identify job postings and needs/gaps",
                    "Description": "Job postings, on either company sites, or in other forums, provide information on organizational structure, needs, and gaps in an organization. This may give an adversary an indication of weakness in an organization (such as under-resourced IT shop). Job postings can also provide information on an organizations structure which could be valuable in social engineering attempts.  "
                },
                {
                    "ID": "T1276",
                    "Name": "Identify supply chains",
                    "Description": "Supply chains include the people, processes, and technologies used to move a product or service from a supplier to a consumer. Understanding supply chains may provide an adversary with opportunities to exploit organizational relationships.  "
                },
                {
                    "ID": "T1281",
                    "Name": "Obtain templates/branding materials",
                    "Description": "Templates and branding materials may be used by an adversary to add authenticity to social engineering message. "
                }
            ]
        },
        "Technical Weakness Identification": {
            "Name": "Technical Weakness Identification",
            "Description": "Technical weakness identification consists of identifying and analyzing weaknesses and vulnerabilities collected during the intelligence gathering phases to determine best approach based on technical complexity and adversary priorities (e.g., expediency, stealthiness).\n                ",
            "ID": "TA0018",
            "Techniques": [
                {
                    "ID": "T1293",
                    "Name": "Analyze application security posture",
                    "Description": "An adversary can probe a victim's network to determine configurations. The configurations may provide opportunities to route traffic through the network in an undetected or less detectable way.  "
                },
                {
                    "ID": "T1288",
                    "Name": "Analyze architecture and configuration posture",
                    "Description": "An adversary may analyze technical scanning results to identify weaknesses in the configuration or architecture of a victim network. These weaknesses could include  architectural flaws, misconfigurations, or improper security controls. "
                },
                {
                    "ID": "T1287",
                    "Name": "Analyze data collected",
                    "Description": "An adversary will assess collected information such as software/hardware versions, vulnerabilities, patch level, etc.  They will analyze technical scanning results to identify weaknesses in the confirmation or architecture.    "
                },
                {
                    "ID": "T1294",
                    "Name": "Analyze hardware/software security defensive capabilities",
                    "Description": "An adversary can probe a victim's network to determine configurations. The configurations may provide opportunities to route traffic through the network in an undetected or less detectable way. "
                },
                {
                    "ID": "T1289",
                    "Name": "Analyze organizational skillsets and deficiencies",
                    "Description": "Analyze strengths and weaknesses of the target for potential areas of where to focus compromise efforts. "
                },
                {
                    "ID": "T1389",
                    "Name": "Identify vulnerabilities in third-party software libraries",
                    "Description": "Many applications use third-party software libraries, often without full knowledge of the behavior of the libraries by the application developer. For example, mobile applications often incorporate advertising libraries to generate revenue for the application developer. Vulnerabilities in these third-party libraries could potentially be exploited in any application that uses the library, and even if the vulnerabilities are fixed, many applications may still use older, vulnerable versions of the library.   "
                },
                {
                    "ID": "T1291",
                    "Name": "Research relevant vulnerabilities/CVEs",
                    "Description": "Common Vulnerability Enumeration (CVE) is a dictionary of publicly known information about security vulnerabilities and exposures. An adversary can use this information to target specific software that may be vulnerable.  "
                },
                {
                    "ID": "T1290",
                    "Name": "Research visibility gap of security vendors",
                    "Description": "If an adversary can identify which security tools a victim is using they may be able to identify ways around those tools. "
                },
                {
                    "ID": "T1292",
                    "Name": "Test signature detection",
                    "Description": "An adversary can test the detections of malicious emails or files by using  publicly available services, such as virus total, to see if their files or emails cause an alert. They can also use similar services that are not openly available and don't publicly publish results or they can test on their own internal infrastructure. "
                }
            ]
        },
        "People Weakness Identification": {
            "Name": "People Weakness Identification",
            "Description": "People weakness identification consists of identifying and analyzing weaknesses and vulnerabilities from the intelligence gathering phases which can be leveraged to gain access to target or intermediate target persons of interest or social trust relationships.\n                ",
            "ID": "TA0019",
            "Techniques": [
                {
                    "ID": "T1297",
                    "Name": "Analyze organizational skillsets and deficiencies",
                    "Description": "Understanding organizational skillsets and deficiencies could provide insight in to weakness in defenses, or opportunities for exploitation. "
                },
                {
                    "ID": "T1295",
                    "Name": "Analyze social and business relationships, interests, and affiliations",
                    "Description": "Social media provides insight into the target's affiliations with groups and organizations.  Certification information can explain their technical associations and professional associations. Personal information can provide data for exploitation or even blackmail. "
                },
                {
                    "ID": "T1296",
                    "Name": "Assess targeting options",
                    "Description": "An adversary may assess a target's operational security (OPSEC) practices in order to identify targeting options. A target may share different information in different settings or be more of less cautious in different environments.  "
                }
            ]
        },
        "Organizational Weakness Identification": {
            "Name": "Organizational Weakness Identification",
            "Description": "Organizational weakness identification consists of identifying and analyzing weaknesses and vulnerabilities from the intelligence gathering phases which can be leveraged to gain access to target or intermediate target organizations of interest.\n                ",
            "ID": "TA0020",
            "Techniques": [
                {
                    "ID": "T1301",
                    "Name": "Analyze business processes",
                    "Description": "Business processes, such as who typically communicates with who, or what the supply chain is for a particular part, provide opportunities for social engineering or other  "
                },
                {
                    "ID": "T1300",
                    "Name": "Analyze organizational skillsets and deficiencies",
                    "Description": "Analyze strengths and weaknesses of the target for potential areas of where to focus compromise efforts. "
                },
                {
                    "ID": "T1303",
                    "Name": "Analyze presence of outsourced capabilities",
                    "Description": "Outsourcing, the arrangement of one company providing goods or services to another company for something that could be done in-house, provides another avenue for an adversary to target. Businesses often have networks, portals, or other technical connections between themselves and their outsourced/partner organizations that could be exploited. Additionally, outsourced/partner organization information could provide opportunities for phishing.  "
                },
                {
                    "ID": "T1299",
                    "Name": "Assess opportunities created by business deals",
                    "Description": "During mergers, divestitures, or other period of change in joint infrastructure or business processes there may be an opportunity for exploitation. During this type of churn, unusual requests, or other non standard practices may not be as noticeable.  "
                },
                {
                    "ID": "T1302",
                    "Name": "Assess security posture of physical locations",
                    "Description": "Physical access may be required for certain types of adversarial actions.  "
                },
                {
                    "ID": "T1298",
                    "Name": "Assess vulnerability of 3rd party vendors",
                    "Description": "Once a 3rd party vendor has been identified as being of interest it can be probed for vulnerabilities just like the main target would be.  "
                }
            ]
        },
        "Adversary OPSEC": {
            "Name": "Adversary OPSEC",
            "Description": "Adversary OPSEC consists of the use of various technologies or 3rd party services to obfuscate, hide, or blend in with accepted network traffic or system behavior.  The adversary may use these techniques to evade defenses, reduce attribution, minimize discovery, and/or increase the time and effort required to analyze.\n                ",
            "ID": "TA0021",
            "Techniques": [
                {
                    "ID": "T1307",
                    "Name": "Acquire and/or use 3rd party infrastructure services",
                    "Description": "A wide variety of cloud, virtual private services, hosting, compute, and storage solutions are available. Additionally botnets are available for rent or purchase. Use of these solutions allow an adversary to stage, launch, and execute an attack from infrastructure that does not physically tie back to them and can be rapidly provisioned, modified, and shut down. "
                },
                {
                    "ID": "T1308",
                    "Name": "Acquire and/or use 3rd party software services",
                    "Description": "A wide variety of 3rd party software services  are available (e.g., Twitter, Dropbox, GoogleDocs). Use of these solutions allow an adversary to stage, launch, and execute an attack from infrastructure that does not physically tie back to them and can be rapidly provisioned, modified, and shut down.  "
                },
                {
                    "ID": "T1310",
                    "Name": "Acquire or compromise 3rd party signing certificates",
                    "Description": "Code signing is the process of digitally signing executables or scripts to confirm the software author and guarantee that the code has not been altered or corrupted. Users may trust a signed piece of code more than an unsigned piece of code even if they don't know who issued the certificate or who the author is. "
                },
                {
                    "ID": "T1306",
                    "Name": "Anonymity services",
                    "Description": "Anonymity services reduce the amount of information available that can be used to track an adversary's activities.  Multiple options are available to hide activity, limit tracking, and increase anonymity.  "
                },
                {
                    "ID": "T1321",
                    "Name": "Common, high volume protocols and software",
                    "Description": "Certain types of traffic (e.g., Twitter14, HTTP) are more commonly used than others. Utilizing more common protocols and software may make an adversary's traffic more difficult to distinguish from legitimate traffic. "
                },
                {
                    "ID": "T1312",
                    "Name": "Compromise 3rd party infrastructure to support delivery",
                    "Description": "Instead of buying, leasing, or renting infrastructure an adversary may compromise infrastructure and use it for some or all of the attack cycle.  "
                },
                {
                    "ID": "T1320",
                    "Name": "Data Hiding",
                    "Description": "Certain types of traffic (e.g., DNS tunneling, header inject) allow for user-defined fields. These fields can then be used to hide data. In addition to hiding data in network protocols, steganography techniques can be used to hide data in images or other file formats. Detection can be difficult unless a particular signature is already known.   "
                },
                {
                    "ID": "T1324",
                    "Name": "DNSCalc",
                    "Description": "DNS Calc is a technique in which the octets of an IP address are used to calculate the port  for command and control servers from an initial DNS request.   "
                },
                {
                    "ID": "T1323",
                    "Name": "Domain Generation Algorithms (DGA)",
                    "Description": "The use of algorithms in malware to periodically generate a large number of domain names which function as rendezvous points for malware command and control servers.  "
                },
                {
                    "ID": "T1311",
                    "Name": "Dynamic DNS",
                    "Description": "Dynamic DNS is a method of automatically updating a name in the DNS system. Providers offer this rapid reconfiguration of IPs to hostnames as a service. "
                },
                {
                    "ID": "T1325",
                    "Name": "Fast Flux DNS",
                    "Description": "A technique in which a fully qualified domain name has multiple IP addresses assigned to it which are swapped with extreme frequency, using a combination of round robin IP address and short Time-To-Live (TTL) for a DNS resource record.    "
                },
                {
                    "ID": "T1314",
                    "Name": "Host-based hiding techniques",
                    "Description": "Host based hiding techniques are designed to allow an adversary to remain undetected on a machine upon which they have taken action. They may do this through the use of  static linking of binaries, polymorphic code, exploiting weakness in file formats, parsers, or self-deleting code. "
                },
                {
                    "ID": "T1322",
                    "Name": "Misattributable credentials",
                    "Description": "The use of credentials by an adversary with the intent to hide their true identity and/or portray them self as another person or entity.  An adversary may use misattributable credentials in an attack to convince a victim that credentials are legitimate and trustworthy when this is not actually the case. "
                },
                {
                    "ID": "T1315",
                    "Name": "Network-based hiding techniques",
                    "Description": "Technical network hiding techniques are methods of modifying traffic to evade network signature detection or to utilize misattribution techniques. Examples include channel/IP/VLAN hopping, mimicking legitimate operations, or seeding with misinformation. "
                },
                {
                    "ID": "T1316",
                    "Name": "Non-traditional or less attributable payment options",
                    "Description": "Using alternative payment options allows an adversary to hide their activities. Options include crypto currencies, barter systems, pre-paid cards or shell accounts. "
                },
                {
                    "ID": "T1309",
                    "Name": "Obfuscate infrastructure",
                    "Description": "Obfuscation is hiding the day-to-day building and testing of new tools, chat servers, etc. "
                },
                {
                    "ID": "T1318",
                    "Name": "Obfuscate operational infrastructure",
                    "Description": "Obfuscation is hiding the day-to-day building and testing of new tools, chat servers, etc. "
                },
                {
                    "ID": "T1319",
                    "Name": "Obfuscate or encrypt code",
                    "Description": "Obfuscation is the act of creating code that is more difficult to understand. Encoding transforms the code using a publicly available format. Encryption transforms the code such that it requires a key to reverse the encryption. "
                },
                {
                    "ID": "T1313",
                    "Name": "Obfuscation or cryptography",
                    "Description": "Obfuscation is the act of creating communications that are more difficult to understand.  Encryption transforms the communications such that it requires a key to reverse the encryption. "
                },
                {
                    "ID": "T1390",
                    "Name": "OS-vendor provided communication channels",
                    "Description": "Google and Apple provide Google Cloud Messaging and Apple Push Notification Service, respectively, services designed to enable efficient communication between third-party mobile app backend servers and the mobile apps running on individual devices. These services maintain an encrypted connection between every mobile device and Google or Apple that cannot easily be inspected and must be allowed to traverse networks as part of normal device operation. These services could be used by adversaries for communication to compromised mobile devices.  "
                },
                {
                    "ID": "T1305",
                    "Name": "Private whois services",
                    "Description": "Every domain registrar maintains a publicly viewable database that displays contact information for every registered domain. Private 'whois' services display alternative information, such as their own company data, rather than the owner of the domain. "
                },
                {
                    "ID": "T1304",
                    "Name": "Proxy/protocol relays",
                    "Description": "Proxies act as an intermediary for clients seeking resources from other systems. Using a proxy may make it more difficult to track back the origin of a network communication. "
                },
                {
                    "ID": "T1317",
                    "Name": "Secure and protect infrastructure",
                    "Description": "An adversary may secure and protect their infrastructure just as defenders do. This could include the use of VPNs, security software, logging and monitoring, passwords, or other defensive measures. "
                }
            ]
        },
        "Establish & Maintain Infrastructure": {
            "Name": "Establish & Maintain Infrastructure",
            "Description": "Establishing and maintaining infrastructure consists of building, purchasing, co-opting, and maintaining systems and services used to conduct cyber operations. An adversary will need to establish infrastructure used to communicate with and control assets used throughout the course of their operations.\n                ",
            "ID": "TA0022",
            "Techniques": [
                {
                    "ID": "T1329",
                    "Name": "Acquire and/or use 3rd party infrastructure services",
                    "Description": "A wide variety of cloud, virtual private services, hosting, compute, and storage solutions are available. Additionally botnets are available for rent or purchase. Use of these solutions allow an adversary to stage, launch, and execute an attack from infrastructure that does not physically tie back to them and can be rapidly provisioned, modified, and shut down. "
                },
                {
                    "ID": "T1330",
                    "Name": "Acquire and/or use 3rd party software services",
                    "Description": "A wide variety of 3rd party software services  are available (e.g., Twitter, Dropbox, GoogleDocs). Use of these solutions allow an adversary to stage, launch, and execute an attack from infrastructure that does not physically tie back to them and can be rapidly provisioned, modified, and shut down. "
                },
                {
                    "ID": "T1332",
                    "Name": "Acquire or compromise 3rd party signing certificates",
                    "Description": "Code signing is the process of digitally signing executables and scripts to confirm the software author and guarantee that the code has not been altered or corrupted. Users may trust a signed piece of code more than an unsigned piece of code even if they don't know who issued the certificate or who the author is. "
                },
                {
                    "ID": "T1328",
                    "Name": "Buy domain name",
                    "Description": "Domain Names are the human readable names used to represent one or more IP addresses. They can be purchased or, in some cases, acquired for free. "
                },
                {
                    "ID": "T1334",
                    "Name": "Compromise 3rd party infrastructure to support delivery",
                    "Description": "Instead of buying, leasing, or renting infrastructure an adversary may compromise infrastructure and use it for some or all of the attack cycle.  "
                },
                {
                    "ID": "T1339",
                    "Name": "Create backup infrastructure",
                    "Description": "Backup infrastructure allows an adversary to recover from environmental and system failures. It also facilitates recovery or movement to other infrastructure if the primary infrastructure is discovered or otherwise is no longer viable. "
                },
                {
                    "ID": "T1326",
                    "Name": "Domain registration hijacking",
                    "Description": "Domain Registration Hijacking is the act of changing the registration of a domain name without the permission of the original registrant. "
                },
                {
                    "ID": "T1333",
                    "Name": "Dynamic DNS",
                    "Description": "Dynamic DNS is a automated method to rapidly update the domain name system mapping of hostnames to IPs. "
                },
                {
                    "ID": "T1336",
                    "Name": "Install and configure hardware, network, and systems",
                    "Description": "An adversary needs the necessary skills to set up procured equipment and software to create their desired infrastructure. "
                },
                {
                    "ID": "T1331",
                    "Name": "Obfuscate infrastructure",
                    "Description": "Obfuscation is hiding the day-to-day building and testing of new tools, chat servers, etc. "
                },
                {
                    "ID": "T1396",
                    "Name": "Obtain booter/stressor subscription",
                    "Description": "Configure and setup booter/stressor services, often intended for server stress testing, to enable denial of service attacks.   "
                },
                {
                    "ID": "T1335",
                    "Name": "Procure required equipment and software",
                    "Description": "An adversary will require some physical hardware and software. They may only need a lightweight set-up if most of their activities will take place using on-line infrastructure. Or, they may need to build extensive infrastructure if they want to test, communicate, and control other aspects of their activities on their own systems. "
                },
                {
                    "ID": "T1340",
                    "Name": "Shadow DNS",
                    "Description": "The process of gathering domain account credentials in order to silently create subdomains pointed at malicious servers without tipping off the actual owner.  "
                },
                {
                    "ID": "T1337",
                    "Name": "SSL certificate acquisition for domain",
                    "Description": "Certificates are designed to instill trust. They  include information about the key, information about its owner's identity, and the digital signature of an entity that has verified the certificate's contents are correct. If the signature is valid, and the person examining the certificate trusts the signer, then they know they can use that key to communicate with its owner. Acquiring a certificate for a  domain name similar to one that is expected to be trusted may allow an adversary to trick a user in to trusting the domain (e.g., vvachovia instead of Wachovia -- homoglyphs).  "
                },
                {
                    "ID": "T1338",
                    "Name": "SSL certificate acquisition for trust breaking",
                    "Description": "Fake certificates can be acquired by legal process or coercion. Or, an adversary can trick a Certificate Authority into issuing a certificate. These fake certificates can be used as a part of Man-in-the-Middle attacks. "
                },
                {
                    "ID": "T1327",
                    "Name": "Use multiple DNS infrastructures",
                    "Description": "A technique used by the adversary similar to Dynamic DNS with the exception that the use of multiple DNS infrastructures likely have whois records. "
                }
            ]
        },
        "Persona Development": {
            "Name": "Persona Development",
            "Description": "Persona development consists of the development of public information, presence, history and appropriate affiliations.  This development could be applied to social media, website, or other publicly available information that could be referenced and scrutinized for legitimacy over the course of an operation using that persona or identity.\n                ",
            "ID": "TA0023",
            "Techniques": [
                {
                    "ID": "T1341",
                    "Name": "Build social network persona",
                    "Description": "For attacks incorporating social engineering the utilization of an on-line persona is important. These personas may be fictitious or impersonate real people. The persona may exist on a single site or across multiple sites (Facebook, LinkedIn, Twitter, Google+, etc.).   "
                },
                {
                    "ID": "T1391",
                    "Name": "Choose pre-compromised mobile app developer account credentials or signing keys",
                    "Description": "The adversary can use account credentials or signing keys of an existing mobile app developer to publish malicious updates of existing mobile apps to an application store, or to abuse the developer's identity and reputation to publish new malicious apps.  Many mobile devices are configured to automatically install new versions of already-installed apps. "
                },
                {
                    "ID": "T1343",
                    "Name": "Choose pre-compromised persona and affiliated accounts",
                    "Description": "For attacks incorporating social engineering the utilization of an on-line persona is important. Utilizing an existing persona with compromised accounts may engender a level of trust in a potential victim if they have a relationship, or knowledge of, the compromised persona.  "
                },
                {
                    "ID": "T1342",
                    "Name": "Develop social network persona digital footprint",
                    "Description": "Both newly built personas and pre-compromised personas may require development of additional documentation to make them seem real. This could include filling out profile information, developing social networks, or incorporating photos.   "
                },
                {
                    "ID": "T1344",
                    "Name": "Friend/Follow/Connect to targets of interest",
                    "Description": "Once a persona has been developed an adversary will use it to create connections to targets of interest. These connections may be direct or may include trying to connect through others.  "
                },
                {
                    "ID": "T1392",
                    "Name": "Obtain Apple iOS enterprise distribution key pair and certificate",
                    "Description": "The adversary can obtain an Apple iOS enterprise distribution key pair and certificate and use it to distribute malicious apps directly to Apple iOS devices without the need to publish the apps to the Apple App Store (where the apps could potentially be detected).    "
                }
            ]
        },
        "Build Capabilities": {
            "Name": "Build Capabilities",
            "Description": "Building capabilities consists of developing and/or acquiring the software, data and techniques used at different phases of an operation.  This is the process of identifying development requirements and implementing solutions such as malware,  delivery mechanisms, obfuscation/cryptographic protections, and call back and O&M functions.\n                ",
            "ID": "TA0024",
            "Techniques": [
                {
                    "ID": "T1347",
                    "Name": "Build and configure delivery systems",
                    "Description": "Delivery systems are the infrastructure used by the adversary to host malware or other tools used during exploitation. Building and configuring delivery systems may include multiple activities such as registering domain names, renting hosting space, or configuring previously exploited environments. "
                },
                {
                    "ID": "T1349",
                    "Name": "Build or acquire exploits",
                    "Description": "An exploit takes advantage of a bug or vulnerability in order to cause unintended or unanticipated behavior to occur on computer hardware or software. The adversary may use or modify existing exploits when those exploits are still relevant to the environment they are trying to compromise.  "
                },
                {
                    "ID": "T1352",
                    "Name": "C2 protocol development",
                    "Description": "Command and Control (C2 or C&C) is a method by which the adversary communicates with malware. An adversary may use a variety of protocols and methods to execute C2 such as a centralized server, peer to peer, IRC, compromised web sites, or even social media. "
                },
                {
                    "ID": "T1354",
                    "Name": "Compromise 3rd party or closed-source vulnerability/exploit information",
                    "Description": "There is usually a delay between when a vulnerability or exploit is discovered and when it is made public. An adversary may target the systems of those known to research vulnerabilities in order to gain that knowledge for use during a different attack. "
                },
                {
                    "ID": "T1345",
                    "Name": "Create custom payloads",
                    "Description": "A payload is the part of the malware which performs a malicious action. The adversary may create custom payloads when none exist with the needed capability or when targeting a specific environment. "
                },
                {
                    "ID": "T1355",
                    "Name": "Create infected removable media",
                    "Description": "Use of removable media as part of the Launch phase requires an adversary to determine type, format, and content of the media and associated malware. "
                },
                {
                    "ID": "T1350",
                    "Name": "Discover new exploits and monitor exploit-provider forums",
                    "Description": "An exploit takes advantage of a bug or vulnerability in order to cause unintended or unanticipated behavior to occur on computer hardware or software. The adversary may need to discover new exploits when existing exploits are no longer relevant to the environment they are trying to compromise. An adversary may monitor exploit provider forums to understand the state of existing, as well as newly discovered, exploits. "
                },
                {
                    "ID": "T1348",
                    "Name": "Identify resources required to build capabilities",
                    "Description": "As with legitimate development efforts, different skill sets may be required for different phases of an attack. The skills needed may be located in house, can be developed, or may need to be contracted out. "
                },
                {
                    "ID": "T1346",
                    "Name": "Obtain/re-use payloads",
                    "Description": "A payload is the part of the malware which performs a malicious action. The adversary may re-use payloads when the needed capability is already available. "
                },
                {
                    "ID": "T1353",
                    "Name": "Post compromise tool development",
                    "Description": "After compromise, an adversary may utilize additional tools to facilitate their end goals. This may include tools to further explore the system, move laterally within a network, exfiltrate data, or destroy data. "
                },
                {
                    "ID": "T1351",
                    "Name": "Remote access tool development",
                    "Description": "A remote access tool (RAT) is a piece of software that allows a remote user to control a system as if they had physical access to that system. An adversary may utilize existing RATs, modify existing RATs, or create their own RAT. "
                }
            ]
        },
        "Test Capabilities": {
            "Name": "Test Capabilities",
            "Description": "Testing capabilities takes place when adversaries may need to test capabilities externally to refine development goals and criteria and to ensure success during an operation. Certain testing may be done after a capability is staged.\n                ",
            "ID": "TA0025",
            "Techniques": [
                {
                    "ID": "T1358",
                    "Name": "Review logs and residual traces",
                    "Description": "Execution of code and network communications often result in logging or other system or network forensic artifacts. An adversary can run their code to identify what is recorded under different conditions. This may result in changes to their code or adding additional actions (such as deleting a record from a log) to the code.  "
                },
                {
                    "ID": "T1393",
                    "Name": "Test ability to evade automated mobile application security analysis performed by app stores",
                    "Description": "Many mobile devices are configured to only allow applications to be installed from the mainstream vendor app stores (e.g., Apple App Store and Google Play Store). An adversary can submit multiple code samples to these stores deliberately designed to probe the stores' security analysis capabilities, with the goal of determining effective techniques to place malicious applications in the stores that could then be delivered to targeted devices.    "
                },
                {
                    "ID": "T1356",
                    "Name": "Test callback functionality",
                    "Description": "Callbacks are malware communications seeking instructions. An adversary will test their malware to ensure the appropriate instructions are conveyed and the callback software can be reached. "
                },
                {
                    "ID": "T1357",
                    "Name": "Test malware in various execution environments",
                    "Description": "Malware may perform differently on different platforms (computer vs handheld) and different operating systems (Ubuntu vs OS X), and versions (Windows 7 vs 10) so malicious actors will test their malware in the environment(s) where they most expect it to be executed. "
                },
                {
                    "ID": "T1359",
                    "Name": "Test malware to evade detection",
                    "Description": "An adversary can run their code on systems with cyber security protections, such as antivirus products, in place to see if their code is detected. They can also test their malware on freely available public services. "
                },
                {
                    "ID": "T1360",
                    "Name": "Test physical access",
                    "Description": "An  adversary can test physical access options in preparation for the actual attack. This could range from observing behaviors and noting security precautions to actually attempting access.  "
                },
                {
                    "ID": "T1361",
                    "Name": "Test signature detection for file upload/email filters",
                    "Description": "An adversary can test their planned method of attack against existing security products such as email filters or intrusion detection sensors (IDS). "
                }
            ]
        },
        "Stage Capabilities": {
            "Name": "Stage Capabilities",
            "Description": "Staging capabilities consists of preparing operational environment required to conduct the operation.  This includes activities such as deploying software, uploading data, enabling command and control infrastructure.\n                ",
            "ID": "TA0026",
            "Techniques": [
                {
                    "ID": "T1379",
                    "Name": "Disseminate removable media",
                    "Description": "Removable media containing malware can be injected in to a supply chain at large or small scale. It can also be physically placed for someone to find or can be sent to someone in a more targeted manner. The intent is to have the user utilize the removable media on a system where the adversary is trying to gain access.   "
                },
                {
                    "ID": "T1394",
                    "Name": "Distribute malicious software development tools",
                    "Description": "An adversary could distribute malicious software development tools (e.g., compiler) that hide malicious behavior in software built using the tools.  "
                },
                {
                    "ID": "T1364",
                    "Name": "Friend/Follow/Connect to targets of interest",
                    "Description": "A form of social engineering designed build trust and to lay the foundation for future interactions or attacks. "
                },
                {
                    "ID": "T1365",
                    "Name": "Hardware or software supply chain implant",
                    "Description": "During production and distribution, the placement of software, firmware, or a CPU chip in a computer, handheld, or other electronic device that enables an adversary to gain illegal entrance.  "
                },
                {
                    "ID": "T1363",
                    "Name": "Port redirector",
                    "Description": "Redirecting a communication request from one address and port number combination to another. May be set up to obfuscate the final location of communications that will occur in later stages of an attack. "
                },
                {
                    "ID": "T1362",
                    "Name": "Upload, install, and configure software/tools",
                    "Description": "An adversary may stage software and tools for use during later stages of an attack. The software and tools may be placed on systems legitimately in use by the adversary or may be placed on previously compromised infrastructure.  "
                }
            ]
        }
    }
}